/*
#############################################################################################
# Guilty Gear Xrd Rev 2 (GGXRD-R2) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.5
# ========================================================================================= #
# File: Core_parameters.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function Core.Object.ProfNodeEvent
// [0x00022401]  (iNative[14087])
struct UObject_execProfNodeEvent_Params
{
	class FString                                      EventName;                                        // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function Core.Object.ProfNodeSetDepthThreshold
// [0x00022401]  (iNative[14088])
struct UObject_execProfNodeSetDepthThreshold_Params
{
	int32_t                                            Depth;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.ProfNodeSetTimeThresholdSeconds
// [0x00022401]  (iNative[14089])
struct UObject_execProfNodeSetTimeThresholdSeconds_Params
{
	float                                              Threshold;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.ProfNodeStop
// [0x00026401]  (iNative[14091])
struct UObject_execProfNodeStop_Params
{
	int32_t                                            AssumedTimerIndex;                                // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.ProfNodeStart
// [0x00022401]  (iNative[14090])
struct UObject_execProfNodeStart_Params
{
	class FString                                      TimerName;                                        // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetStringFromGuid
// [0x00422401]  (iNative[13838])
struct UObject_execGetStringFromGuid_Params
{
	struct FGuid                                       InGuid;                                           // 0x0000 (0x0010) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class FString                                      ReturnValue;                                      // 0x0010 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetGuidFromString
// [0x00422401]  (iNative[13825])
struct UObject_execGetGuidFromString_Params
{
	class FString                                      InGuidString;                                     // 0x0000 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FGuid                                       ReturnValue;                                      // 0x000C (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.CreateGuid
// [0x00022401]  (iNative[13698])
struct UObject_execCreateGuid_Params
{
	struct FGuid                                       ReturnValue;                                      // 0x0000 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsGuidValid
// [0x00422401]  (iNative[13919])
struct UObject_execIsGuidValid_Params
{
	struct FGuid                                       InGuid;                                           // 0x0000 (0x0010) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.InvalidateGuid
// [0x00422401]  (iNative[13906])
struct UObject_execInvalidateGuid_Params
{
	struct FGuid                                       InGuid;                                           // 0x0000 (0x0010) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.GetLanguage
// [0x00022401]  (iNative[13827])
struct UObject_execGetLanguage_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetRandomOptionSumFrequency
// [0x00420003] 
struct UObject_execGetRandomOptionSumFrequency_Params
{
	class TArray<float>                                FreqList;                                         // 0x0000 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                           FreqSum;                                          // 0x0010 (0x0004) [0x0000000000000000]               
	// float                                           RandVal;                                          // 0x0014 (0x0004) [0x0000000000000000]               
	// int32_t                                         Idx;                                              // 0x0018 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetBuildChangelistNumber
// [0x00020401]  (iNative[13819])
struct UObject_execGetBuildChangelistNumber_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEngineVersion
// [0x00020401]  (iNative[13821])
struct UObject_execGetEngineVersion_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetSystemTime
// [0x00420401]  (iNative[13839])
struct UObject_execGetSystemTime_Params
{
	int32_t                                            Year;                                             // 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Month;                                            // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            DayOfWeek;                                        // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Day;                                              // 0x000C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Hour;                                             // 0x0010 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Min;                                              // 0x0014 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Sec;                                              // 0x0018 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            MSec;                                             // 0x001C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.TimeStamp
// [0x00020401]  (iNative[14209])
struct UObject_execTimeStamp_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.TransformVectorByRotation
// [0x00024401]  (iNative[14215])
struct UObject_execTransformVectorByRotation_Params
{
	struct FRotator                                    SourceRotation;                                   // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SourceVector;                                     // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bInverse : 1;                                     // 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      // 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPackageName
// [0x00020003] 
struct UObject_execGetPackageName_Params
{
	class FName                                        ReturnValue;                                      // 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UObject*                                  O;                                                // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.IsPendingKill
// [0x00020401]  (iNative[13921])
struct UObject_execIsPendingKill_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ByteToFloat
// [0x00024103] 
struct UObject_execByteToFloat_Params
{
	uint8_t                                            inputByte;                                        // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bSigned : 1;                                      // 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FloatToByte
// [0x00024103] 
struct UObject_execFloatToByte_Params
{
	float                                              inputFloat;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bSigned : 1;                                      // 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint8_t                                            ReturnValue;                                      // 0x0008 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.UnwindHeading
// [0x00022103] 
struct UObject_execUnwindHeading_Params
{
	float                                              A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FindDeltaAngle
// [0x00022103] 
struct UObject_execFindDeltaAngle_Params
{
	float                                              A1;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              A2;                                               // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                           Delta;                                            // 0x000C (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetHeadingAngle
// [0x00022103] 
struct UObject_execGetHeadingAngle_Params
{
	struct FVector                                     Dir;                                              // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                           Angle;                                            // 0x0010 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.GetAngularDegreesFromRadians
// [0x00422103] 
struct UObject_execGetAngularDegreesFromRadians_Params
{
	struct FVector2D                                   OutFOV;                                           // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.GetAngularFromDotDist
// [0x00422401]  (iNative[13817])
struct UObject_execGetAngularFromDotDist_Params
{
	struct FVector2D                                   OutAngDist;                                       // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   DotDist;                                          // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.GetAngularDistance
// [0x00422401]  (iNative[13816])
struct UObject_execGetAngularDistance_Params
{
	struct FVector2D                                   OutAngularDist;                                   // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            // 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            // 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetDotDistance
// [0x00422401]  (iNative[13820])
struct UObject_execGetDotDistance_Params
{
	struct FVector2D                                   OutDotDist;                                       // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            // 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            // 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointProjectToPlane
// [0x00022401]  (iNative[14081])
struct UObject_execPointProjectToPlane_Params
{
	struct FVector                                     Point;                                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     A;                                                // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                // 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     C;                                                // 0x0024 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x0030 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToPlane
// [0x00C24103] 
struct UObject_execPointDistToPlane_Params
{
	struct FVector                                     Point;                                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    Orientation;                                      // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Origin;                                           // 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     out_ClosestPoint;                                 // 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      // 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  AxisX;                                            // 0x0034 (0x000C) [0x0000000000000000]               
	// struct FVector                                  AxisY;                                            // 0x0040 (0x000C) [0x0000000000000000]               
	// struct FVector                                  AxisZ;                                            // 0x004C (0x000C) [0x0000000000000000]               
	// struct FVector                                  PointNoZ;                                         // 0x0058 (0x000C) [0x0000000000000000]               
	// struct FVector                                  OriginNoZ;                                        // 0x0064 (0x000C) [0x0000000000000000]               
	// float                                           fPointZ;                                          // 0x0070 (0x0004) [0x0000000000000000]               
	// float                                           fProjDistToAxis;                                  // 0x0074 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.PointDistToSegment
// [0x00424401]  (iNative[14079])
struct UObject_execPointDistToSegment_Params
{
	struct FVector                                     Point;                                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     StartPoint;                                       // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     EndPoint;                                         // 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  // 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      // 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToLine
// [0x00424401]  (iNative[14077])
struct UObject_execPointDistToLine_Params
{
	struct FVector                                     Point;                                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Line;                                             // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Origin;                                           // 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  // 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      // 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPerObjectConfigSections
// [0x00426401]  (iNative[13830])
struct UObject_execGetPerObjectConfigSections_Params
{
	class UClass*                                      SearchClass;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<class FString>                        out_SectionNames;                                 // 0x0004 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class UObject*                                     ObjectOuter;                                      // 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            MaxResults;                                       // 0x0014 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ImportJSON
// [0x00422401]  (iNative[13872])
struct UObject_execImportJSON_Params
{
	class FString                                      PropertyName;                                     // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      JSON;                                             // 0x000C (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function Core.Object.StaticSaveConfig
// [0x00022401]  (iNative[14162])
struct UObject_execStaticSaveConfig_Params
{
};

// Function Core.Object.SaveConfig
// [0x00020401]  (iNative[14130])
struct UObject_execSaveConfig_Params
{
};

// Function Core.Object.FindObject
// [0x00022401]  (iNative[13791])
struct UObject_execFindObject_Params
{
	class FString                                      ObjectName;                                       // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UClass*                                      ObjectClass;                                      // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      // 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DynamicLoadObject
// [0x00026401]  (iNative[13744])
struct UObject_execDynamicLoadObject_Params
{
	class FString                                      ObjectName;                                       // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UClass*                                      ObjectClass;                                      // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           MayFail : 1;                                      // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     ReturnValue;                                      // 0x0014 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEnum
// [0x00022401]  (iNative[13822])
struct UObject_execGetEnum_Params
{
	class UObject*                                     E;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            I;                                                // 0x0004 (0x0004) [0x0000000000000880] (CPF_Parm | CPF_CoerceParm)
	class FName                                        ReturnValue;                                      // 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Disable
// [0x00020401]  (iNative[13725])
struct UObject_execDisable_Params
{
	class FName                                        ProbeFunc;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.Enable
// [0x00020401]  (iNative[13767])
struct UObject_execEnable_Params
{
	class FName                                        ProbeFunc;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.ContinuedState
// [0x00020800] 
struct UObject_eventContinuedState_Params
{
};

// Function Core.Object.PausedState
// [0x00020800] 
struct UObject_eventPausedState_Params
{
};

// Function Core.Object.PoppedState
// [0x00020800] 
struct UObject_eventPoppedState_Params
{
};

// Function Core.Object.PushedState
// [0x00020800] 
struct UObject_eventPushedState_Params
{
};

// Function Core.Object.EndState
// [0x00020800] 
struct UObject_eventEndState_Params
{
	class FName                                        NextStateName;                                    // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.BeginState
// [0x00020800] 
struct UObject_eventBeginState_Params
{
	class FName                                        PreviousStateName;                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.DumpStateStack
// [0x00020401]  (iNative[13742])
struct UObject_execDumpStateStack_Params
{
};

// Function Core.Object.PopState
// [0x00024401]  (iNative[14083])
struct UObject_execPopState_Params
{
	uint32_t                                           bPopAll : 1;                                      // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.PushState
// [0x00024401]  (iNative[14094])
struct UObject_execPushState_Params
{
	class FName                                        NewState;                                         // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FName                                        NewLabel;                                         // 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.GetStateName
// [0x00020401]  (iNative[13837])
struct UObject_execGetStateName_Params
{
	class FName                                        ReturnValue;                                      // 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsChildState
// [0x00020401]  (iNative[13916])
struct UObject_execIsChildState_Params
{
	class FName                                        TestState;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FName                                        TestParentState;                                  // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsInState
// [0x00024401]  (iNative[13920])
struct UObject_execIsInState_Params
{
	class FName                                        TestState;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bTestStateStack : 1;                              // 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GotoState
// [0x00024401]  (iNative[13842])
struct UObject_execGotoState_Params
{
	class FName                                        NewState;                                         // 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class FName                                        Label;                                            // 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bForceEvents : 1;                                 // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bKeepStack : 1;                                   // 0x0014 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.IsUTracing
// [0x00022401]  (iNative[13923])
struct UObject_execIsUTracing_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SetUTracing
// [0x00022401]  (iNative[14144])
struct UObject_execSetUTracing_Params
{
	uint32_t                                           bShouldUTrace : 1;                                // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Core.Object.GetFuncName
// [0x00022401]  (iNative[13824])
struct UObject_execGetFuncName_Params
{
	class FName                                        ReturnValue;                                      // 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DebugBreak
// [0x00026401]  (iNative[13707])
struct UObject_execDebugBreak_Params
{
	int32_t                                            UserFlags;                                        // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint8_t                                            DebuggerType;                                     // 0x0004 (0x0001) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.GetScriptTrace
// [0x00022401]  (iNative[13836])
struct UObject_execGetScriptTrace_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.ScriptTrace
// [0x00022401]  (iNative[14137])
struct UObject_execScriptTrace_Params
{
};

// Function Core.Object.ParseLocalizedPropertyPath
// [0x00022003] 
struct UObject_execParseLocalizedPropertyPath_Params
{
	class FString                                      PathName;                                         // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      // 0x000C (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class TArray<class FString>                     Pieces;                                           // 0x0018 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function Core.Object.Localize
// [0x00022400]  (iNative[13948])
struct UObject_execLocalize_Params
{
	class FString                                      SectionName;                                      // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      KeyName;                                          // 0x000C (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      PackageName;                                      // 0x0018 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      // 0x0024 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.WarnInternal
// [0x00042401]  (iNative[14250])
struct UObject_execWarnInternal_Params
{
	class FString                                      S;                                                // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function Core.Object.LogInternal
// [0x00046401]  (iNative[13953])
struct UObject_execLogInternal_Params
{
	class FString                                      S;                                                // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FName                                        Tag;                                              // 0x000C (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.Subtract_LinearColorLinearColor
// [0x00023003] 
struct UObject_execSubtract_LinearColorLinearColor_Params
{
	struct FLinearColor                                A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_LinearColorFloat
// [0x00023003] 
struct UObject_execMultiply_LinearColorFloat_Params
{
	struct FLinearColor                                LC;                                               // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              Mult;                                             // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      // 0x0014 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ColorToLinearColor
// [0x00022003] 
struct UObject_execColorToLinearColor_Params
{
	struct FColor                                      OldColor;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      // 0x0004 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeLinearColor
// [0x00822003] 
struct UObject_execMakeLinearColor_Params
{
	float                                              R;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              G;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              A;                                                // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      // 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FLinearColor                             LC;                                               // 0x0020 (0x0010) [0x0000000000000000]               
};

// Function Core.Object.LerpColor
// [0x00822003] 
struct UObject_execLerpColor_Params
{
	struct FColor                                      A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Alpha;                                            // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  FloatA;                                           // 0x0010 (0x000C) [0x0000000000000000]               
	// struct FVector                                  FloatB;                                           // 0x001C (0x000C) [0x0000000000000000]               
	// struct FVector                                  FloatResult;                                      // 0x0028 (0x000C) [0x0000000000000000]               
	// float                                           AlphaA;                                           // 0x0034 (0x0004) [0x0000000000000000]               
	// float                                           AlphaB;                                           // 0x0038 (0x0004) [0x0000000000000000]               
	// float                                           FloatResultAlpha;                                 // 0x003C (0x0004) [0x0000000000000000]               
	// struct FColor                                   Result;                                           // 0x0040 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.MakeColor
// [0x00826003] 
struct UObject_execMakeColor_Params
{
	uint8_t                                            R;                                                // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            G;                                                // 0x0001 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            B;                                                // 0x0002 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            A;                                                // 0x0003 (0x0001) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FColor                                      ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FColor                                   C;                                                // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.Add_ColorColor
// [0x00023003] 
struct UObject_execAdd_ColorColor_Params
{
	struct FColor                                      A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_ColorFloat
// [0x00023003] 
struct UObject_execMultiply_ColorFloat_Params
{
	struct FColor                                      A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_FloatColor
// [0x00023003] 
struct UObject_execMultiply_FloatColor_Params
{
	float                                              A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Subtract_ColorColor
// [0x00023003] 
struct UObject_execSubtract_ColorColor_Params
{
	struct FColor                                      A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EvalInterpCurveVector2D
// [0x00422401]  (iNative[13781])
struct UObject_execEvalInterpCurveVector2D_Params
{
	struct FInterpCurveVector2D                        Vector2DCurve;                                    // 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	float                                              InVal;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0014 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EvalInterpCurveVector
// [0x00422401]  (iNative[13780])
struct UObject_execEvalInterpCurveVector_Params
{
	struct FInterpCurveVector                          VectorCurve;                                      // 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	float                                              InVal;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x0014 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EvalInterpCurveFloat
// [0x00422401]  (iNative[13779])
struct UObject_execEvalInterpCurveFloat_Params
{
	struct FInterpCurveFloat                           FloatCurve;                                       // 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	float                                              InVal;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x0014 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.vect2d
// [0x00822003] 
struct UObject_execvect2d_Params
{
	float                                              InX;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              InY;                                              // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector2D                                NewVect2d;                                        // 0x0010 (0x0008) [0x0000000000000000]               
};

// Function Core.Object.GetMappedRangeValue
// [0x00022501]  (iNative[13828])
struct UObject_execGetMappedRangeValue_Params
{
	struct FVector2D                                   InputRange;                                       // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   OutputRange;                                      // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x0014 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetRangePctByValue
// [0x00022103] 
struct UObject_execGetRangePctByValue_Params
{
	struct FVector2D                                   Range;                                            // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetRangeValueByPct
// [0x00022103] 
struct UObject_execGetRangeValueByPct_Params
{
	struct FVector2D                                   Range;                                            // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Pct;                                              // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SubtractEqual_Vector2DVector2D
// [0x00423401]  (iNative[13536])
struct UObject_execSubtractEqual_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.AddEqual_Vector2DVector2D
// [0x00423401]  (iNative[13533])
struct UObject_execAddEqual_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DivideEqual_Vector2DFloat
// [0x00423401]  (iNative[13538])
struct UObject_execDivideEqual_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MultiplyEqual_Vector2DFloat
// [0x00423401]  (iNative[13530])
struct UObject_execMultiplyEqual_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Divide_Vector2DFloat
// [0x00023401]  (iNative[13537])
struct UObject_execDivide_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_Vector2DFloat
// [0x00023401]  (iNative[13528])
struct UObject_execMultiply_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Subtract_Vector2DVector2D
// [0x00023401]  (iNative[13534])
struct UObject_execSubtract_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Add_Vector2DVector2D
// [0x00023401]  (iNative[13531])
struct UObject_execAdd_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Subtract_QuatQuat
// [0x00023401]  (iNative[13534])
struct UObject_execSubtract_QuatQuat_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Add_QuatQuat
// [0x00023401]  (iNative[13531])
struct UObject_execAdd_QuatQuat_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatSlerp
// [0x00026401]  (iNative[14102])
struct UObject_execQuatSlerp_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              Alpha;                                            // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bShortestPath : 1;                                // 0x0024 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FQuat                                       ReturnValue;                                      // 0x0030 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatToRotator
// [0x00022401]  (iNative[14103])
struct UObject_execQuatToRotator_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    ReturnValue;                                      // 0x0010 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatFromRotator
// [0x00022401]  (iNative[14098])
struct UObject_execQuatFromRotator_Params
{
	struct FRotator                                    A;                                                // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatFromAxisAndAngle
// [0x00022401]  (iNative[14097])
struct UObject_execQuatFromAxisAndAngle_Params
{
	struct FVector                                     Axis;                                             // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              Angle;                                            // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatFindBetween
// [0x00022401]  (iNative[14096])
struct UObject_execQuatFindBetween_Params
{
	struct FVector                                     A;                                                // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatRotateVector
// [0x00022401]  (iNative[14101])
struct UObject_execQuatRotateVector_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                // 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatInvert
// [0x00022401]  (iNative[14099])
struct UObject_execQuatInvert_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatDot
// [0x00022401]  (iNative[14095])
struct UObject_execQuatDot_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x0020 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatProduct
// [0x00022401]  (iNative[14100])
struct UObject_execQuatProduct_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MatrixGetAxis
// [0x00022401]  (iNative[13969])
struct UObject_execMatrixGetAxis_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            Axis;                                             // 0x0040 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x0044 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MatrixGetOrigin
// [0x00022401]  (iNative[13970])
struct UObject_execMatrixGetOrigin_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x0040 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MatrixGetRotator
// [0x00022401]  (iNative[13971])
struct UObject_execMatrixGetRotator_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    ReturnValue;                                      // 0x0040 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeRotationMatrix
// [0x00022401]  (iNative[13962])
struct UObject_execMakeRotationMatrix_Params
{
	struct FRotator                                    Rotation;                                         // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
