/*
#############################################################################################
# Guilty Gear Xrd Rev 2 (GGXRD-R2) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.5
# ========================================================================================= #
# File: Engine_parameters.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function Engine.Actor.GetActorSpriteComponent
// [0x00020400]  (iNative[21582])
struct AActor_execGetActorSpriteComponent_Params
{
	class USpriteComponent*                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
};

// Function Engine.Actor.GetActorMetrics
// [0x00020500]  (iNative[21580])
struct AActor_execGetActorMetrics_Params
{
	uint8_t                                            MetricsType;                                      // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.OnMobileTouch
// [0x00020802] 
struct AActor_eventOnMobileTouch_Params
{
	class APlayerController*                           InPC;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   TouchLocation;                                    // 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.IsMobileTouchEnabled
// [0x00020002] 
struct AActor_execIsMobileTouchEnabled_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.ShouldBeHiddenBySHOW_NavigationNodes
// [0x00020400]  (iNative[28278])
struct AActor_execShouldBeHiddenBySHOW_NavigationNodes_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.WillOverlap
// [0x00420401]  (iNative[30306])
struct AActor_execWillOverlap_Params
{
	struct FVector                                     PosA;                                             // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     VelA;                                             // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     PosB;                                             // 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     VelB;                                             // 0x0024 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              StepSize;                                         // 0x0030 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Radius;                                           // 0x0034 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Time;                                             // 0x0038 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  // 0x003C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetAvoidanceVector
// [0x00424401]  (iNative[21617])
struct AActor_execGetAvoidanceVector_Params
{
	class TArray<class AActor*>                        Obstacles;                                        // 0x0000 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FVector                                     GoalLocation;                                     // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              CollisionRadius;                                  // 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              MaxSpeed;                                         // 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            NumSamples;                                       // 0x0020 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              VelocityStepRate;                                 // 0x0024 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              MaxTimeTilOverlap;                                // 0x0028 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      // 0x002C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.ReplicationEnded
// [0x00020900] 
struct AActor_eventReplicationEnded_Params
{
};

// Function Engine.Actor.PostDemoRewind
// [0x00020900] 
struct AActor_eventPostDemoRewind_Params
{
};

// Function Engine.Actor.AnimTreeUpdated
// [0x00020900] 
struct AActor_eventAnimTreeUpdated_Params
{
	class USkeletalMeshComponent*                      SkelMesh;                                         // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function Engine.Actor.SupportsKismetModification
// [0x00420401]  (iNative[29058])
struct AActor_execSupportsKismetModification_Params
{
	class USequenceOp*                                 AskingOp;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      Reason;                                           // 0x0004 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetAnimTrailParticleSystem
// [0x00020400]  (iNative[21611])
struct AActor_execGetAnimTrailParticleSystem_Params
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   // 0x0000 (0x0004) [0x0000000000000082] (CPF_Const | CPF_Parm)
	class UParticleSystem*                             ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.TrailsNotifyEnd
// [0x00020800] 
struct AActor_eventTrailsNotifyEnd_Params
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   // 0x0000 (0x0004) [0x0000000000000082] (CPF_Const | CPF_Parm)
};

// Function Engine.Actor.TrailsNotifyTick
// [0x00020800] 
struct AActor_eventTrailsNotifyTick_Params
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   // 0x0000 (0x0004) [0x0000000000000082] (CPF_Const | CPF_Parm)
};

// Function Engine.Actor.TrailsNotify
// [0x00020800] 
struct AActor_eventTrailsNotify_Params
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   // 0x0000 (0x0004) [0x0000000000000082] (CPF_Const | CPF_Parm)
};

// Function Engine.Actor.CreateForceField
// [0x00020802] 
struct AActor_eventCreateForceField_Params
{
	class UAnimNotify_ForceField*                      AnimNotifyData;                                   // 0x0000 (0x0004) [0x0000000000000082] (CPF_Const | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.PlayParticleEffect
// [0x00020802] 
struct AActor_eventPlayParticleEffect_Params
{
	class UAnimNotify_PlayParticleEffect*              AnimNotifyData;                                   // 0x0000 (0x0004) [0x0000000000000082] (CPF_Const | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetAimAdhesionExtent
// [0x00420102] 
struct AActor_execGetAimAdhesionExtent_Params
{
	float                                              Width;                                            // 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              Height;                                           // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Center;                                           // 0x0008 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Engine.Actor.GetAimFrictionExtent
// [0x00420102] 
struct AActor_execGetAimFrictionExtent_Params
{
	float                                              Width;                                            // 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              Height;                                           // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Center;                                           // 0x0008 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Engine.Actor.IsInPersistentLevel
// [0x00024401]  (iNative[22917])
struct AActor_execIsInPersistentLevel_Params
{
	uint32_t                                           bIncludeLevelStreamingPersistent : 1;             // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.OnRigidBodySpringOverextension
// [0x00020900] 
struct AActor_eventOnRigidBodySpringOverextension_Params
{
	class URB_BodyInstance*                            BodyInstance;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.GetPackageGuid
// [0x00022401]  (iNative[21871])
struct AActor_execGetPackageGuid_Params
{
	class FName                                        PackageName;                                      // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FGuid                                       ReturnValue;                                      // 0x0008 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.PostInitAnimTree
// [0x00020800] 
struct AActor_eventPostInitAnimTree_Params
{
	class USkeletalMeshComponent*                      SkelComp;                                         // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function Engine.Actor.RootMotionExtracted
// [0x00420900] 
struct AActor_eventRootMotionExtracted_Params
{
	class USkeletalMeshComponent*                      SkelComp;                                         // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FBoneAtom                                   ExtractedRootMotionDelta;                         // 0x0010 (0x0050) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Engine.Actor.RootMotionProcessed
// [0x00020900] 
struct AActor_eventRootMotionProcessed_Params
{
	class USkeletalMeshComponent*                      SkelComp;                                         // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function Engine.Actor.RootMotionModeChanged
// [0x00020900] 
struct AActor_eventRootMotionModeChanged_Params
{
	class USkeletalMeshComponent*                      SkelComp;                                         // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function Engine.Actor.PostRenderFor
// [0x00020900] 
struct AActor_eventPostRenderFor_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.NativePostRenderFor
// [0x00020500]  (iNative[24468])
struct AActor_execNativePostRenderFor_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.SetHUDLocation
// [0x00020500]  (iNative[28001])
struct AActor_execSetHUDLocation_Params
{
	struct FVector                                     NewHUDLocation;                                   // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnRanOver
// [0x00020800] 
struct AActor_eventOnRanOver_Params
{
	class ASVehicle*                                   Vehicle;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UPrimitiveComponent*                         RunOverComponent;                                 // 0x0004 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	int32_t                                            WheelIndex;                                       // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.RigidBodyCollision
// [0x00420800] 
struct AActor_eventRigidBodyCollision_Params
{
	class UPrimitiveComponent*                         HitComponent;                                     // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UPrimitiveComponent*                         OtherComponent;                                   // 0x0004 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FCollisionImpactData                        RigidCollisionData;                               // 0x0008 (0x0024) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int32_t                                            ContactIndex;                                     // 0x002C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.InterpolationChanged
// [0x00020900] 
struct AActor_eventInterpolationChanged_Params
{
	class USeqAct_Interp*                              InterpAction;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.InterpolationFinished
// [0x00020900] 
struct AActor_eventInterpolationFinished_Params
{
	class USeqAct_Interp*                              InterpAction;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.InterpolationStarted
// [0x00020900] 
struct AActor_eventInterpolationStarted_Params
{
	class USeqAct_Interp*                              InterpAction;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UInterpGroupInst*                            GroupInst;                                        // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.SpawnedByKismet
// [0x00020800] 
struct AActor_eventSpawnedByKismet_Params
{
};

// Function Engine.Actor.GetTargetLocation
// [0x00024500]  (iNative[22022])
struct AActor_execGetTargetLocation_Params
{
	class AActor*                                      RequestedBy;                                      // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bRequestAlternateLoc : 1;                         // 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      // 0x0008 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.FindGoodEndView
// [0x00420102] 
struct AActor_execFindGoodEndView_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    GoodRotation;                                     // 0x0004 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Engine.Actor.NotifyLocalPlayerTeamReceived
// [0x00020100] 
struct AActor_execNotifyLocalPlayerTeamReceived_Params
{
};

// Function Engine.Actor.ScriptGetTeamNum
// [0x00020902] 
struct AActor_eventScriptGetTeamNum_Params
{
	uint8_t                                            ReturnValue;                                      // 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetTeamNum
// [0x00020500]  (iNative[22025])
struct AActor_execGetTeamNum_Params
{
	uint8_t                                            ReturnValue;                                      // 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.PawnBaseDied
// [0x00020000] 
struct AActor_execPawnBaseDied_Params
{
};

// Function Engine.Actor.IsPlayerOwned
// [0x00020500]  (iNative[22947])
struct AActor_execIsPlayerOwned_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetActorEyesViewPoint
// [0x00420902] 
struct AActor_eventGetActorEyesViewPoint_Params
{
	struct FVector                                     out_Location;                                     // 0x0000 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FRotator                                    out_Rotation;                                     // 0x000C (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Engine.Actor.IsStationary
// [0x00020002] 
struct AActor_execIsStationary_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetActorFaceFXAsset
// [0x00020800] 
struct AActor_eventGetActorFaceFXAsset_Params
{
	class UFaceFXAsset*                                ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.CanActorPlayFaceFXAnim
// [0x00020102] 
struct AActor_execCanActorPlayFaceFXAnim_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.IsActorPlayingFaceFXAnim
// [0x00020102] 
struct AActor_execIsActorPlayingFaceFXAnim_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.TickSkelControl
// [0x00020800] 
struct AActor_eventTickSkelControl_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class USkeletalMeshComponent*                      SkelComp;                                         // 0x0004 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class USkelControlBase*                            SkelCtrl;                                         // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.SetSkelControlScale
// [0x00020800] 
struct AActor_eventSetSkelControlScale_Params
{
	class FName                                        SkelControlName;                                  // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Scale;                                            // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.SetMorphWeight
// [0x00020800] 
struct AActor_eventSetMorphWeight_Params
{
	class FName                                        MorphNodeName;                                    // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              MorphWeight;                                      // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.StopActorFaceFXAnim
// [0x00020800] 
struct AActor_eventStopActorFaceFXAnim_Params
{
};

// Function Engine.Actor.PlayActorFaceFXAnim
// [0x00020800] 
struct AActor_eventPlayActorFaceFXAnim_Params
{
	class UFaceFXAnimSet*                              AnimSet;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      GroupName;                                        // 0x0004 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      SeqName;                                          // 0x0010 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class USoundCue*                                   SoundCueToPlay;                                   // 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.FinishAnimControl
// [0x00020800] 
struct AActor_eventFinishAnimControl_Params
{
	class UInterpGroup*                                InInterpGroup;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.SetAnimPosition
// [0x00020800] 
struct AActor_eventSetAnimPosition_Params
{
	class FName                                        SlotName;                                         // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ChannelIndex;                                     // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FName                                        InAnimSeqName;                                    // 0x000C (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              InPosition;                                       // 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bFireNotifies : 1;                                // 0x0018 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bLooping : 1;                                     // 0x001C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bEnableRootMotion : 1;                            // 0x0020 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Engine.Actor.BeginAnimControl
// [0x00020800] 
struct AActor_eventBeginAnimControl_Params
{
	class UInterpGroup*                                InInterpGroup;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnAnimPlay
// [0x00020800] 
struct AActor_eventOnAnimPlay_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnAnimEnd
// [0x00020800] 
struct AActor_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.DoKismetAttachment
// [0x00820002] 
struct AActor_execDoKismetAttachment_Params
{
	class AActor*                                      Attachment;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class USeqAct_AttachToActor*                       Action;                                           // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// uint32_t                                        bOldCollideActors : 1;                            // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// uint32_t                                        bOldBlockActors : 1;                              // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  X;                                                // 0x0010 (0x000C) [0x0000000000000000]               
	// struct FVector                                  Y;                                                // 0x001C (0x000C) [0x0000000000000000]               
	// struct FVector                                  Z;                                                // 0x0028 (0x000C) [0x0000000000000000]               
};

// Function Engine.Actor.OnAttachToActor
// [0x00020002] 
struct AActor_execOnAttachToActor_Params
{
	class USeqAct_AttachToActor*                       Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         Idx;                                              // 0x0004 (0x0004) [0x0000000000000000]               
	// class AActor*                                   Attachment;                                       // 0x0008 (0x0004) [0x0000000000000000]               
	// class AController*                              C;                                                // 0x000C (0x0004) [0x0000000000000000]               
	// class TArray<class UObject*>                    objVars;                                          // 0x0010 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function Engine.Actor.OnToggleHidden
// [0x00020102] 
struct AActor_execOnToggleHidden_Params
{
	class USeqAct_ToggleHidden*                        Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         AttachIdx;                                        // 0x0004 (0x0004) [0x0000000000000000]               
	// int32_t                                         IgnoreIdx;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	// class AActor*                                   A;                                                // 0x000C (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.OnChangeCollision
// [0x00020002] 
struct AActor_execOnChangeCollision_Params
{
	class USeqAct_ChangeCollision*                     Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnSetPhysics
// [0x00020102] 
struct AActor_execOnSetPhysics_Params
{
	class USeqAct_SetPhysics*                          Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnSetBlockRigidBody
// [0x00020102] 
struct AActor_execOnSetBlockRigidBody_Params
{
	class USeqAct_SetBlockRigidBody*                   Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnSetVelocity
// [0x00820102] 
struct AActor_execOnSetVelocity_Params
{
	class USeqAct_SetVelocity*                         Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// struct FVector                                  V;                                                // 0x0004 (0x000C) [0x0000000000000000]               
	// float                                           Mag;                                              // 0x0010 (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.OnTeleport
// [0x00820102] 
struct AActor_execOnTeleport_Params
{
	class USeqAct_Teleport*                            Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class TArray<class UObject*>                    objVars;                                          // 0x0004 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// int32_t                                         Idx;                                              // 0x0010 (0x0004) [0x0000000000000000]               
	// class AActor*                                   destActor;                                        // 0x0014 (0x0004) [0x0000000000000000]               
	// class AActor*                                   tempActor;                                        // 0x0018 (0x0004) [0x0000000000000000]               
	// class AActor*                                   A;                                                // 0x001C (0x0004) [0x0000000000000000]               
	// class AController*                              C;                                                // 0x0020 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bOccupiedDest : 1;                                // 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	// uint32_t                                        bColliding : 1;                                   // 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	// float                                           ColRadius;                                        // 0x002C (0x0004) [0x0000000000000000]               
	// float                                           ColHeight;                                        // 0x0030 (0x0004) [0x0000000000000000]               
	// struct FVector                                  Extent;                                           // 0x0034 (0x000C) [0x0000000000000000]               
};

// Function Engine.Actor.OnModifyHealth
// [0x00020102] 
struct AActor_execOnModifyHealth_Params
{
	class USeqAct_ModifyHealth*                        Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class AController*                              InstigatorController;                             // 0x0004 (0x0004) [0x0000000000000000]               
	// class APawn*                                    InstigatorPawn;                                   // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.PrestreamTextures
// [0x00024400]  (iNative[26408])
struct AActor_execPrestreamTextures_Params
{
	float                                              Seconds;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bEnableStreaming : 1;                             // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	int32_t                                            CinematicTextureGroups;                           // 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Engine.Actor.ShutDown
// [0x00020902] 
struct AActor_eventShutDown_Params
{
};

// Function Engine.Actor.SetNetUpdateTime
// [0x00020401]  (iNative[28058])
struct AActor_execSetNetUpdateTime_Params
{
	float                                              NewUpdateTime;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.ForceNetRelevant
// [0x00020802] 
struct AActor_eventForceNetRelevant_Params
{
};

// Function Engine.Actor.OnDestroy
// [0x00020102] 
struct AActor_execOnDestroy_Params
{
	class USeqAct_Destroy*                             Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         AttachIdx;                                        // 0x0004 (0x0004) [0x0000000000000000]               
	// int32_t                                         IgnoreIdx;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	// class AActor*                                   A;                                                // 0x000C (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.ClearLatentAction
// [0x00024103] 
struct AActor_execClearLatentAction_Params
{
	class UClass*                                      actionClass;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bAborted : 1;                                     // 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class USeqAct_Latent*                              exceptionAction;                                  // 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	// int32_t                                         Idx;                                              // 0x000C (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.FindEventsOfClass
// [0x00424103] 
struct AActor_execFindEventsOfClass_Params
{
	class UClass*                                      EventClass;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<class USequenceEvent*>                out_EventList;                                    // 0x0004 (0x000C) [0x0000000000400190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           bIncludeDisabled : 1;                             // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class USequenceEvent*                           Evt;                                              // 0x0018 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bFoundEvent : 1;                                  // 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.ActivateEventClass
// [0x00424103] 
struct AActor_execActivateEventClass_Params
{
	class UClass*                                      InClass;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      InInstigator;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<class USequenceEvent*>                EventList;                                        // 0x0008 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class TArray<int32_t>                              ActivateIndices;                                  // 0x0014 (0x000C) [0x0000000000400192] (CPF_Const | CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           bTest : 1;                                        // 0x0020 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class TArray<class USequenceEvent*>                ActivatedEvents;                                  // 0x0024 (0x000C) [0x0000000000400190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	bool                                               ReturnValue : 1;                                  // 0x0030 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class USequenceEvent*                           Evt;                                              // 0x0034 (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.TriggerGlobalEventClass
// [0x00024102] 
struct AActor_execTriggerGlobalEventClass_Params
{
	class UClass*                                      InEventClass;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      InInstigator;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ActivateIndex;                                    // 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class TArray<class USequenceObject*>            EventsToActivate;                                 // 0x0010 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class TArray<int32_t>                           ActivateIndices;                                  // 0x001C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class USequence*                                GameSeq;                                          // 0x0028 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bResult : 1;                                      // 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
	// int32_t                                         I;                                                // 0x0030 (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.ReceivedNewEvent
// [0x00020900] 
struct AActor_eventReceivedNewEvent_Params
{
	class USequenceEvent*                              Evt;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.TriggerEventClass
// [0x00424102] 
struct AActor_execTriggerEventClass_Params
{
	class UClass*                                      InEventClass;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      InInstigator;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ActivateIndex;                                    // 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bTest : 1;                                        // 0x000C (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class TArray<class USequenceEvent*>                ActivatedEvents;                                  // 0x0010 (0x000C) [0x0000000000400190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	bool                                               ReturnValue : 1;                                  // 0x001C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class TArray<int32_t>                           ActivateIndices;                                  // 0x0020 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function Engine.Actor.DebugMessagePlayer
// [0x00020801] 
struct AActor_eventDebugMessagePlayer_Params
{
	class FString                                      msg;                                              // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function Engine.Actor.ImpactEffectIsRelevant
// [0x00824102] 
struct AActor_execImpactEffectIsRelevant_Params
{
	class APawn*                                       EffectInstigator;                                 // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SpawnLocation;                                    // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bForceDedicated : 1;                              // 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              VisibleCullDistance;                              // 0x0014 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              HiddenCullDistance;                               // 0x0018 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bSkipLOSCheck : 1;                                // 0x001C (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class APlayerController*                        P;                                                // 0x0024 (0x0004) [0x0000000000000000]               
	// float                                           DistSq;                                           // 0x0028 (0x0004) [0x0000000000000000]               
	// float                                           InViewThreshold;                                  // 0x002C (0x0004) [0x0000000000000000]               
	// uint32_t                                        bIsInViewFrustrum : 1;                            // 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  CameraLoc;                                        // 0x0034 (0x000C) [0x0000000000000000]               
	// struct FRotator                                 CameraRot;                                        // 0x0040 (0x000C) [0x0000000000000000]               
};

// Function Engine.Actor.ActorEffectIsRelevant
// [0x00824102] 
struct AActor_execActorEffectIsRelevant_Params
{
	class APawn*                                       EffectInstigator;                                 // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bForceDedicated : 1;                              // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              VisibleCullDistance;                              // 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              HiddenCullDistance;                               // 0x000C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class APlayerController*                        P;                                                // 0x0014 (0x0004) [0x0000000000000000]               
	// float                                           DistSq;                                           // 0x0018 (0x0004) [0x0000000000000000]               
	// struct FVector                                  CameraLoc;                                        // 0x001C (0x000C) [0x0000000000000000]               
	// struct FRotator                                 CameraRot;                                        // 0x0028 (0x000C) [0x0000000000000000]               
};

// Function Engine.Actor.EffectIsRelevant
// [0x00024102] 
struct AActor_execEffectIsRelevant_Params
{
	struct FVector                                     SpawnLocation;                                    // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bForceDedicated : 1;                              // 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              VisibleCullDistance;                              // 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              HiddenCullDistance;                               // 0x0014 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.ApplyFluidSurfaceImpact
// [0x00020102] 
struct AActor_execApplyFluidSurfaceImpact_Params
{
	class AFluidSurfaceActor*                          Fluid;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	// float                                           Radius;                                           // 0x0010 (0x0004) [0x0000000000000000]               
	// float                                           Height;                                           // 0x0014 (0x0004) [0x0000000000000000]               
	// float                                           AdjustedVelocity;                                 // 0x0018 (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.CanSplash
// [0x00020102] 
struct AActor_execCanSplash_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.PlayTeleportEffect
// [0x00020000] 
struct AActor_execPlayTeleportEffect_Params
{
	uint32_t                                           bOut : 1;                                         // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bSound : 1;                                       // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Engine.Actor.IsInPain
// [0x00020002] 
struct AActor_execIsInPain_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class APhysicsVolume*                           V;                                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.Reset
// [0x00020800] 
struct AActor_eventReset_Params
{
};

// Function Engine.Actor.GetFaceFXAudioComponent
// [0x00020902] 
struct AActor_eventGetFaceFXAudioComponent_Params
{
	class UAudioComponent*                             ReturnValue;                                      // 0x0000 (0x0004) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
};

// Function Engine.Actor.ModifyHearSoundComponent
// [0x00020900] 
struct AActor_eventModifyHearSoundComponent_Params
{
	class UAudioComponent*                             AC;                                               // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function Engine.Actor.GetPhysicsName
// [0x00020102] 
struct AActor_execGetPhysicsName_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Engine.Actor.DisplayDebug
// [0x00420102] 
struct AActor_execDisplayDebug_Params
{
	class AHUD*                                        HUD;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              out_YL;                                           // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_YPos;                                         // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	// class FString                                   T;                                                // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class AActor*                                   A;                                                // 0x0018 (0x0004) [0x0000000000000000]               
	// float                                           MyRadius;                                         // 0x001C (0x0004) [0x0000000000000000]               
	// float                                           MyHeight;                                         // 0x0020 (0x0004) [0x0000000000000000]               
	// class UCanvas*                                  Canvas;                                           // 0x0024 (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.GetDebugName
// [0x00020002] 
struct AActor_execGetDebugName_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Engine.Actor.MatchStarting
// [0x00020000] 
struct AActor_execMatchStarting_Params
{
};

// Function Engine.Actor.GetLocalString
// [0x00026002] 
struct AActor_execGetLocalString_Params
{
	int32_t                                            Switch;                                           // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class APlayerReplicationInfo*                      RelatedPRI;                                       // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class APlayerReplicationInfo*                      RelatedPRI01;                                     // 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class FString                                      ReturnValue;                                      // 0x000C (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Engine.Actor.ReplaceText
// [0x00422002] 
struct AActor_execReplaceText_Params
{
	class FString                                      Text;                                             // 0x0000 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      Replace;                                          // 0x000C (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      With;                                             // 0x0018 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// int32_t                                         I;                                                // 0x0024 (0x0004) [0x0000000000000000]               
	// class FString                                   Input;                                            // 0x0028 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function Engine.Actor.GetHumanReadableName
// [0x00020102] 
struct AActor_execGetHumanReadableName_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Engine.Actor.GetItemName
// [0x00020102] 
struct AActor_execGetItemName_Params
{
	class FString                                      FullName;                                         // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      // 0x000C (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// int32_t                                         pos;                                              // 0x0018 (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.CalcCamera
// [0x00C20102] 
struct AActor_execCalcCamera_Params
{
	float                                              fDeltaTime;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     out_CamLoc;                                       // 0x0004 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FRotator                                    out_CamRot;                                       // 0x0010 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_FOV;                                          // 0x001C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  // 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  HitNormal;                                        // 0x0024 (0x000C) [0x0000000000000000]               
	// float                                           Radius;                                           // 0x0030 (0x0004) [0x0000000000000000]               
	// float                                           Height;                                           // 0x0034 (0x0004) [0x0000000000000000]               
};

// Function Engine.Actor.EndViewTarget
// [0x00020800] 
struct AActor_eventEndViewTarget_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.BecomeViewTarget
// [0x00020800] 
struct AActor_eventBecomeViewTarget_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.CheckForErrors
// [0x00020000] 
struct AActor_execCheckForErrors_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.DebugFreezeGame
// [0x00024800] 
struct AActor_eventDebugFreezeGame_Params
{
	class AActor*                                      ActorToLookAt;                                    // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Engine.Actor.GetGravityZ
// [0x00020400]  (iNative[21766])
struct AActor_execGetGravityZ_Params
{
	float                                              ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.CheckHitInfo
// [0x00C20103] 
struct AActor_execCheckHitInfo_Params
{
	struct FTraceHitInfo                               HitInfo;                                          // 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UPrimitiveComponent*                         FallBackComponent;                                // 0x001C (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FVector                                     Dir;                                              // 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     out_HitLocation;                                  // 0x002C (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	// struct FVector                                  out_NewHitLocation;                               // 0x0038 (0x000C) [0x0000000000000000]               
	// struct FVector                                  out_HitNormal;                                    // 0x0044 (0x000C) [0x0000000000000000]               
	// struct FVector                                  TraceEnd;                                         // 0x0050 (0x000C) [0x0000000000000000]               
	// struct FVector                                  TraceStart;                                       // 0x005C (0x000C) [0x0000000000000000]               
	// struct FTraceHitInfo                            newHitInfo;                                       // 0x0068 (0x001C) [0x0000000000000000]               
};

// Function Engine.Actor.TakeRadiusDamage
// [0x00824102] 
struct AActor_execTakeRadiusDamage_Params
{
	class AController*                                 InstigatedBy;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              BaseDamage;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DamageRadius;                                     // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UClass*                                      DamageType;                                       // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Momentum;                                         // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HurtOrigin;                                       // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bFullDamage : 1;                                  // 0x0020 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
