/*
#############################################################################################
# Guilty Gear Xrd Rev 2 (GGXRD-R2) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.5
# ========================================================================================= #
# File: GameFramework_parameters.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function GameFramework.GameAIController.GetActionString
// [0x00020903] 
struct AGameAIController_eventGetActionString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                   ActionStr;                                        // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class UGameAICommand*                           ActiveCmd;                                        // 0x0018 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameAIController.SetDesiredRotation
// [0x00024002] 
struct AGameAIController_execSetDesiredRotation_Params
{
	struct FRotator                                    TargetDesiredRotation;                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           InLockDesiredRotation : 1;                        // 0x000C (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           InUnlockWhenReached : 1;                          // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              InterpolationTime;                                // 0x0014 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GameFramework.GameAIController.AILog_Internal
// [0x00024800] 
struct AGameAIController_eventAILog_Internal_Params
{
	class FString                                      LogText;                                          // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FName                                        LogCategory;                                      // 0x000C (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bForce : 1;                                       // 0x0014 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function GameFramework.GameAIController.RecordDemoAILog
// [0x00080000] 
struct AGameAIController_execRecordDemoAILog_Params
{
	class FString                                      LogText;                                          // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameAIController.Destroyed
// [0x00020802] 
struct AGameAIController_eventDestroyed_Params
{
};

// Function GameFramework.GameAIController.ReachedIntermediateMoveGoal
// [0x00020000] 
struct AGameAIController_execReachedIntermediateMoveGoal_Params
{
};

// Function GameFramework.GameAIController.ReachedMoveGoal
// [0x00020000] 
struct AGameAIController_execReachedMoveGoal_Params
{
};

// Function GameFramework.GameAIController.GetDestinationOffset
// [0x00020000] 
struct AGameAIController_execGetDestinationOffset_Params
{
	float                                              ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAIController.GetAICommandInStack
// [0x00020400]  (iNative[34015])
struct AGameAIController_execGetAICommandInStack_Params
{
	class UClass*                                      InClass;                                          // 0x0000 (0x0004) [0x0000000000000082] (CPF_Const | CPF_Parm)
	class UGameAICommand*                              ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAIController.FindCommandOfClass
// [0x00020401]  (iNative[33923])
struct AGameAIController_execFindCommandOfClass_Params
{
	class UClass*                                      SearchClass;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UGameAICommand*                              ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function GameFramework.GameAIController.DumpCommandStack
// [0x00020401]  (iNative[33855])
struct AGameAIController_execDumpCommandStack_Params
{
};

// Function GameFramework.GameAIController.CheckCommandCount
// [0x00020401]  (iNative[33663])
struct AGameAIController_execCheckCommandCount_Params
{
};

// Function GameFramework.GameAIController.GetActiveCommand
// [0x00020401]  (iNative[34012])
struct AGameAIController_execGetActiveCommand_Params
{
	class UGameAICommand*                              ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAIController.AbortCommand
// [0x00024400]  (iNative[33221])
struct AGameAIController_execAbortCommand_Params
{
	class UGameAICommand*                              AbortCmd;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UClass*                                      AbortClass;                                       // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAIController.PopCommand
// [0x00020400]  (iNative[34471])
struct AGameAIController_execPopCommand_Params
{
	class UGameAICommand*                              ToBePoppedCommand;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAIController.PushCommand
// [0x00020400]  (iNative[34513])
struct AGameAIController_execPushCommand_Params
{
	class UGameAICommand*                              NewCommand;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAIController.AllCommands
// [0x00420405]  (iNative[33284])
struct AGameAIController_execAllCommands_Params
{
	class UClass*                                      BaseClass;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UGameAICommand*                              Cmd;                                              // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function GameFramework.GameAICommand.HandlePathObstruction
// [0x00020002] 
struct UGameAICommand_execHandlePathObstruction_Params
{
	class AActor*                                      BlockedBy;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAICommand.MoveUnreachable
// [0x00020000] 
struct UGameAICommand_execMoveUnreachable_Params
{
	struct FVector                                     AttemptedDest;                                    // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      AttemptedTarget;                                  // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAICommand.NotifyNeedRepath
// [0x00020000] 
struct UGameAICommand_execNotifyNeedRepath_Params
{
};

// Function GameFramework.GameAICommand.GetDebugVerboseText
// [0x00020800] 
struct UGameAICommand_eventGetDebugVerboseText_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameAICommand.GetDebugOverheadText
// [0x00420000] 
struct UGameAICommand_execGetDebugOverheadText_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<class FString>                        OutText;                                          // 0x0004 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameAICommand.DrawDebug
// [0x00020800] 
struct UGameAICommand_eventDrawDebug_Params
{
	class AHUD*                                        H;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FName                                        Category;                                         // 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.GetDumpString
// [0x00020802] 
struct UGameAICommand_eventGetDumpString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameAICommand.Resumed
// [0x00020002] 
struct UGameAICommand_execResumed_Params
{
	class FName                                        OldCommandName;                                   // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.Paused
// [0x00020002] 
struct UGameAICommand_execPaused_Params
{
	class UGameAICommand*                              NewCommand;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.Popped
// [0x00020002] 
struct UGameAICommand_execPopped_Params
{
};

// Function GameFramework.GameAICommand.Pushed
// [0x00020002] 
struct UGameAICommand_execPushed_Params
{
};

// Function GameFramework.GameAICommand.PostPopped
// [0x00020000] 
struct UGameAICommand_execPostPopped_Params
{
};

// Function GameFramework.GameAICommand.PrePushed
// [0x00020000] 
struct UGameAICommand_execPrePushed_Params
{
	class AGameAIController*                           AI;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.AllowStateTransitionTo
// [0x00020002] 
struct UGameAICommand_execAllowStateTransitionTo_Params
{
	class FName                                        StateName;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAICommand.AllowTransitionTo
// [0x00020002] 
struct UGameAICommand_execAllowTransitionTo_Params
{
	class UClass*                                      AttemptCommand;                                   // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAICommand.Tick
// [0x00020000] 
struct UGameAICommand_execTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.ShouldIgnoreNotifies
// [0x00020401]  (iNative[34660])
struct UGameAICommand_execShouldIgnoreNotifies_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAICommand.InternalTick
// [0x00020803] 
struct UGameAICommand_eventInternalTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.InternalResumed
// [0x00020803] 
struct UGameAICommand_eventInternalResumed_Params
{
	class FName                                        OldCommandName;                                   // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.InternalPaused
// [0x00020803] 
struct UGameAICommand_eventInternalPaused_Params
{
	class UGameAICommand*                              NewCommand;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.InternalPopped
// [0x00020802] 
struct UGameAICommand_eventInternalPopped_Params
{
};

// Function GameFramework.GameAICommand.InternalPushed
// [0x00020803] 
struct UGameAICommand_eventInternalPushed_Params
{
};

// Function GameFramework.GameAICommand.InternalPrePushed
// [0x00020803] 
struct UGameAICommand_eventInternalPrePushed_Params
{
	class AGameAIController*                           AI;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.InitCommand
// [0x00022002] 
struct UGameAICommand_execInitCommand_Params
{
	class AGameAIController*                           AI;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UGameAICommand*                           Cmd;                                              // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameAICommand.InitCommandUserActor
// [0x00022002] 
struct UGameAICommand_execInitCommandUserActor_Params
{
	class AGameAIController*                           AI;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      UserActor;                                        // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GamePlayerController.ClientColorFade
// [0x010201C0] 
struct AGamePlayerController_execClientColorFade_Params
{
	struct FColor                                      FadeColor;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            FromAlpha;                                        // 0x0004 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            ToAlpha;                                          // 0x0005 (0x0001) [0x0000000000000080] (CPF_Parm)    
	float                                              FadeTime;                                         // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GamePlayerController.WarmupPause
// [0x00820802] 
struct AGamePlayerController_eventWarmupPause_Params
{
	uint32_t                                           bDesiredPauseState : 1;                           // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// struct FColor                                   FadeColor;                                        // 0x0004 (0x0004) [0x0000000000000000]               
	// class APlayerController*                        PC;                                               // 0x0008 (0x0004) [0x0000000000000000]               
	// class FString                                   MovieName;                                        // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function GameFramework.GamePlayerController.CanUnpauseWarmup
// [0x00020002] 
struct AGamePlayerController_execCanUnpauseWarmup_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GamePlayerController.GetCurrentMovie
// [0x00420401]  (iNative[34020])
struct AGamePlayerController_execGetCurrentMovie_Params
{
	class FString                                      MovieName;                                        // 0x0000 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function GameFramework.GamePlayerController.ClientStopMovie
// [0x01020DC1]  (iNative[13067])
struct AGamePlayerController_eventClientStopMovie_Params
{
	float                                              DelayInSeconds;                                   // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bAllowMovieToFinish : 1;                          // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bForceStopNonSkippable : 1;                       // 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bForceStopLoadingMovie : 1;                       // 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GameFramework.GamePlayerController.ClientPlayMovie
// [0x01020DC1]  (iNative[13066])
struct AGamePlayerController_eventClientPlayMovie_Params
{
	class FString                                      MovieName;                                        // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            InStartOfRenderingMovieFrame;                     // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            InEndOfRenderingMovieFrame;                       // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bRestrictPausing : 1;                             // 0x0014 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bPlayOnceFromStream : 1;                          // 0x0018 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bOnlyBackButtonSkipsMovie : 1;                    // 0x001C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GameFramework.GamePlayerController.KeepPlayingLoadingMovie
// [0x00022401]  (iNative[34162])
struct AGamePlayerController_execKeepPlayingLoadingMovie_Params
{
};

// Function GameFramework.GamePlayerController.ShowLoadingMovie
// [0x00026401]  (iNative[34664])
struct AGamePlayerController_execShowLoadingMovie_Params
{
	uint32_t                                           bShowMovie : 1;                                   // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bPauseAfterHide : 1;                              // 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              PauseDuration;                                    // 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              KeepPlayingDuration;                              // 0x000C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bOverridePreviousDelays : 1;                      // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function GameFramework.GamePlayerController.SetSoundMode
// [0x00020102] 
struct AGamePlayerController_execSetSoundMode_Params
{
	class FName                                        InSoundModeName;                                  // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class UAudioDevice*                             Audio;                                            // 0x0008 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bSet : 1;                                         // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GamePlayerController.DoForceFeedbackForScreenShake
// [0x00080102] 
struct AGamePlayerController_execDoForceFeedbackForScreenShake_Params
{
	class UCameraShake*                                ShakeData;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Scale;                                            // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         ShakeLevel;                                       // 0x0008 (0x0004) [0x0000000000000000]               
	// float                                           RotMag;                                           // 0x000C (0x0004) [0x0000000000000000]               
	// float                                           LocMag;                                           // 0x0010 (0x0004) [0x0000000000000000]               
	// float                                           FOVMag;                                           // 0x0014 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GamePlayerController.NotifyCrowdAgentInRadius
// [0x00020800] 
struct AGamePlayerController_eventNotifyCrowdAgentInRadius_Params
{
	class AGameCrowdAgent*                             Agent;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GamePlayerController.NotifyCrowdAgentRefresh
// [0x00020800] 
struct AGamePlayerController_eventNotifyCrowdAgentRefresh_Params
{
};

// Function GameFramework.GamePlayerController.CrowdDebug
// [0x00020202] 
struct AGamePlayerController_execCrowdDebug_Params
{
	uint32_t                                           bEnabled : 1;                                     // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class AGameCrowdAgent*                          GCA;                                              // 0x0004 (0x0004) [0x0000000000000000]               
	// int32_t                                         I;                                                // 0x0008 (0x0004) [0x0000000000000000]               
	// int32_t                                         AgentCount;                                       // 0x000C (0x0004) [0x0000000000000000]               
	// float                                           DebugRadius;                                      // 0x0010 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GamePlayerController.GetUIPlayerIndex
// [0x00020400]  (iNative[34043])
struct AGamePlayerController_execGetUIPlayerIndex_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GamePlayerController.OnToggleMouseCursor
// [0x00020002] 
struct AGamePlayerController_execOnToggleMouseCursor_Params
{
	class USeqAct_ToggleMouseCursor*                   inAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class UGameViewportClient*                      GVC;                                              // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCheatManager.OnRequestComplete
// [0x00020002] 
struct UGameCheatManager_execOnRequestComplete_Params
{
	class UHttpRequestInterface*                       OriginalRequest;                                  // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UHttpResponseInterface*                      Response;                                         // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bDidSucceed : 1;                                  // 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class TArray<class FString>                     Headers;                                          // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                   Header;                                           // 0x0018 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                   Payload;                                          // 0x0024 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// int32_t                                         PayloadIndex;                                     // 0x0030 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCheatManager.TestHttp
// [0x00024202] 
struct UGameCheatManager_execTestHttp_Params
{
	class FString                                      Verb;                                             // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      Payload;                                          // 0x000C (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      URL;                                              // 0x0018 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           bSendParallelRequest : 1;                         // 0x0024 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	// class UHttpRequestInterface*                    R;                                                // 0x0028 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCheatManager.EnableDebugCamera
// [0x00820002] 
struct UGameCheatManager_execEnableDebugCamera_Params
{
	uint32_t                                           bEnableDebugText : 1;                             // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class UPlayer*                                  P;                                                // 0x0004 (0x0004) [0x0000000000000000]               
	// struct FVector                                  eyeLoc;                                           // 0x0008 (0x000C) [0x0000000000000000]               
	// struct FRotator                                 eyeRot;                                           // 0x0014 (0x000C) [0x0000000000000000]               
	// float                                           CameraFOVAngle;                                   // 0x0020 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCheatManager.TeleportPawnToCamera
// [0x00824202] 
struct UGameCheatManager_execTeleportPawnToCamera_Params
{
	uint32_t                                           bToggleDebugCameraOff : 1;                        // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	// class APlayerController*                        PC;                                               // 0x0004 (0x0004) [0x0000000000000000]               
	// class ADebugCameraController*                   DCC;                                              // 0x0008 (0x0004) [0x0000000000000000]               
	// struct FVector                                  ViewLocation;                                     // 0x000C (0x000C) [0x0000000000000000]               
	// struct FRotator                                 ViewRotation;                                     // 0x0018 (0x000C) [0x0000000000000000]               
};

// Function GameFramework.GameCheatManager.ToggleDebugCamera
// [0x00024202] 
struct UGameCheatManager_execToggleDebugCamera_Params
{
	uint32_t                                           bDrawDebugText : 1;                               // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	// class APlayerController*                        PC;                                               // 0x0004 (0x0004) [0x0000000000000000]               
	// class ADebugCameraController*                   DCC;                                              // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCheatManager.PatchDebugCameraController
// [0x00020002] 
struct UGameCheatManager_execPatchDebugCameraController_Params
{
	// class UClass*                                   TempCameraControllerClass;                        // 0x0000 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.InitDebugColor
// [0x00020102] 
struct AGameCrowdAgent_execInitDebugColor_Params
{
};

// Function GameFramework.GameCrowdAgent.GetBehaviorString
// [0x00020002] 
struct AGameCrowdAgent_execGetBehaviorString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                   BehaviorString;                                   // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function GameFramework.GameCrowdAgent.GetDestString
// [0x00020002] 
struct AGameCrowdAgent_execGetDestString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                   DestString;                                       // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function GameFramework.GameCrowdAgent.PostRenderFor
// [0x00820902] 
struct AGameCrowdAgent_eventPostRenderFor_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	// float                                           NameXL;                                           // 0x0020 (0x0004) [0x0000000000000000]               
	// float                                           TextXL;                                           // 0x0024 (0x0004) [0x0000000000000000]               
	// float                                           BehavXL;                                          // 0x0028 (0x0004) [0x0000000000000000]               
	// float                                           TextYL;                                           // 0x002C (0x0004) [0x0000000000000000]               
	// float                                           YL;                                               // 0x0030 (0x0004) [0x0000000000000000]               
	// float                                           XL;                                               // 0x0034 (0x0004) [0x0000000000000000]               
	// struct FVector                                  ScreenLoc;                                        // 0x0038 (0x000C) [0x0000000000000000]               
	// class FString                                   ScreenName;                                       // 0x0044 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                   DestString;                                       // 0x0050 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                   BehaviorString;                                   // 0x005C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// struct FFontRenderInfo                          FontInfo;                                         // 0x0068 (0x0028) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.NativePostRenderFor
// [0x00020500]  (iNative[24468])
struct AGameCrowdAgent_execNativePostRenderFor_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.GeneratePathToActor
// [0x00824802] 
struct AGameCrowdAgent_eventGeneratePathToActor_Params
{
	class AActor*                                      Goal;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              WithinDistance;                                   // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bAllowPartialPath : 1;                            // 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      // 0x000C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  NextDest;                                         // 0x0018 (0x000C) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.InitNavigationHandle
// [0x00020802] 
struct AGameCrowdAgent_eventInitNavigationHandle_Params
{
};

// Function GameFramework.GameCrowdAgent.OverlappedActorEvent
// [0x00020800] 
struct AGameCrowdAgent_eventOverlappedActorEvent_Params
{
	class AActor*                                      A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.TakeDamage
// [0x00024002] 
struct AGameCrowdAgent_execTakeDamage_Params
{
	int32_t                                            DamageAmount;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 EventInstigator;                                  // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UClass*                                      DamageType;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GameFramework.GameCrowdAgent.FireDeathEvent
// [0x00020902] 
struct AGameCrowdAgent_eventFireDeathEvent_Params
{
};

// Function GameFramework.GameCrowdAgent.PlayDeath
// [0x00020400]  (iNative[34460])
struct AGameCrowdAgent_execPlayDeath_Params
{
	struct FVector                                     KillMomentum;                                     // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.UpdateIntermediatePoint
// [0x00024802] 
struct AGameCrowdAgent_eventUpdateIntermediatePoint_Params
{
	class AActor*                                      DestinationActor;                                 // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GameFramework.GameCrowdAgent.CalcCamera
// [0x00C20102] 
struct AGameCrowdAgent_execCalcCamera_Params
{
	float                                              fDeltaTime;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     out_CamLoc;                                       // 0x0004 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FRotator                                    out_CamRot;                                       // 0x0010 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_FOV;                                          // 0x001C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  // 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  HitNormal;                                        // 0x0024 (0x000C) [0x0000000000000000]               
	// float                                           Radius;                                           // 0x0030 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.IsIdle
// [0x00020400]  (iNative[34151])
struct AGameCrowdAgent_execIsIdle_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgent.SetCurrentBehavior
// [0x00020401]  (iNative[34638])
struct AGameCrowdAgent_execSetCurrentBehavior_Params
{
	class UGameCrowdAgentBehavior*                     BehaviorArchetype;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.StopBehavior
// [0x00020802] 
struct AGameCrowdAgent_eventStopBehavior_Params
{
};

// Function GameFramework.GameCrowdAgent.HandleBehaviorEvent
// [0x00020802] 
struct AGameCrowdAgent_eventHandleBehaviorEvent_Params
{
	uint8_t                                            EventType;                                        // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      InInstigator;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bViralCause : 1;                                  // 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bPropagateViralFlag : 1;                          // 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// uint32_t                                        bActivatedBehavior : 1;                           // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgent.ActivateInstancedBehavior
// [0x00020002] 
struct AGameCrowdAgent_execActivateInstancedBehavior_Params
{
	class UGameCrowdAgentBehavior*                     NewBehaviorObject;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.ActivateBehavior
// [0x00024802] 
struct AGameCrowdAgent_eventActivateBehavior_Params
{
	class UGameCrowdAgentBehavior*                     NewBehaviorArchetype;                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      LookAtActor;                                      // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GameFramework.GameCrowdAgent.ResetSeePlayer
// [0x00020002] 
struct AGameCrowdAgent_execResetSeePlayer_Params
{
};

// Function GameFramework.GameCrowdAgent.TryRandomBehavior
// [0x00020002] 
struct AGameCrowdAgent_execTryRandomBehavior_Params
{
	// uint32_t                                        bFoundBehavior : 1;                               // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// int32_t                                         I;                                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.NotifySeePlayer
// [0x00020802] 
struct AGameCrowdAgent_eventNotifySeePlayer_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// uint32_t                                        bFoundBehavior : 1;                               // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// int32_t                                         I;                                                // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.PlaySpawnBehavior
// [0x00020002] 
struct AGameCrowdAgent_execPlaySpawnBehavior_Params
{
};

// Function GameFramework.GameCrowdAgent.HandlePotentialAgentEncounter
// [0x00020802] 
struct AGameCrowdAgent_eventHandlePotentialAgentEncounter_Params
{
};

// Function GameFramework.GameCrowdAgent.StopIdleAnimation
// [0x00020900] 
struct AGameCrowdAgent_eventStopIdleAnimation_Params
{
};

// Function GameFramework.GameCrowdAgent.PlayIdleAnimation
// [0x00020900] 
struct AGameCrowdAgent_eventPlayIdleAnimation_Params
{
};

// Function GameFramework.GameCrowdAgent.OnPlayAgentAnimation
// [0x00020102] 
struct AGameCrowdAgent_execOnPlayAgentAnimation_Params
{
	class USeqAct_PlayAgentAnimation*                  Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.InitializeAgent
// [0x00C20102] 
struct AGameCrowdAgent_execInitializeAgent_Params
{
	class AActor*                                      SpawnLoc;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<struct FCrowdSpawnerPlayerInfo>       PlayerInfo;                                       // 0x0004 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class AGameCrowdAgent*                             AgentTemplate;                                    // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UGameCrowdGroup*                             NewGroup;                                         // 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              AgentWarmupTime;                                  // 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bWarmupPosition : 1;                              // 0x001C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bCheckWarmupVisibility : 1;                       // 0x0020 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// uint32_t                                        bGroupDestination : 1;                            // 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	// uint32_t                                        bRealPreferVisible : 1;                           // 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	// class AGameCrowdDestination*                    SpawnDest;                                        // 0x002C (0x0004) [0x0000000000000000]               
	// float                                           TryPct;                                           // 0x0030 (0x0004) [0x0000000000000000]               
	// float                                           MaxSpawnDist;                                     // 0x0034 (0x0004) [0x0000000000000000]               
	// float                                           DestDist;                                         // 0x0038 (0x0004) [0x0000000000000000]               
	// float                                           StartDist;                                        // 0x003C (0x0004) [0x0000000000000000]               
	// struct FVector                                  TryLoc;                                           // 0x0040 (0x000C) [0x0000000000000000]               
	// class AActor*                                   HitActor;                                         // 0x004C (0x0004) [0x0000000000000000]               
	// struct FVector                                  HitLocation;                                      // 0x0050 (0x000C) [0x0000000000000000]               
	// struct FVector                                  HitNormal;                                        // 0x005C (0x000C) [0x0000000000000000]               
	// struct FVector                                  NearestViewLocation;                              // 0x0068 (0x000C) [0x0000000000000000]               
	// struct FVector                                  YAdjust;                                          // 0x0074 (0x000C) [0x0000000000000000]               
	// uint32_t                                        bVisibleTryLoc : 1;                               // 0x0080 (0x0004) [0x0000000000000000] [0x00000001] 
	// uint32_t                                        bFoundOption : 1;                                 // 0x0084 (0x0004) [0x0000000000000000] [0x00000001] 
	// int32_t                                         CheckCnt;                                         // 0x0088 (0x0004) [0x0000000000000000]               
	// int32_t                                         MaxCheckCnt;                                      // 0x008C (0x0004) [0x0000000000000000]               
	// int32_t                                         OptionIdx;                                        // 0x0090 (0x0004) [0x0000000000000000]               
	// class TArray<struct FVector>                    TryOptions;                                       // 0x0094 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// float                                           SpawnDestRadius;                                  // 0x00A0 (0x0004) [0x0000000000000000]               
	// float                                           TravelDestRadius;                                 // 0x00A4 (0x0004) [0x0000000000000000]               
	// int32_t                                         PlayerIdx;                                        // 0x00A8 (0x0004) [0x0000000000000000]               
	// float                                           NearestViewDistSq;                                // 0x00AC (0x0004) [0x0000000000000000]               
	// float                                           ViewDistSq;                                       // 0x00B0 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bVisibleOption : 1;                               // 0x00B4 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgent.GetAttemptedSpawnLocation
// [0x00820102] 
struct AGameCrowdAgent_execGetAttemptedSpawnLocation_Params
{
	float                                              Pct;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CurPos;                                           // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              CurRadius;                                        // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     DestPos;                                          // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              DestRadius;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x0024 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                           MaxLateralOffset;                                 // 0x0030 (0x0004) [0x0000000000000000]               
	// float                                           LateralOffset;                                    // 0x0034 (0x0004) [0x0000000000000000]               
	// struct FVector                                  LateralDir;                                       // 0x0038 (0x000C) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.SetLighting
// [0x00020102] 
struct AGameCrowdAgent_execSetLighting_Params
{
	uint32_t                                           bEnableLightEnvironment : 1;                      // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	struct FLightingChannelContainer                   AgentLightingChannel;                             // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bCastShadows : 1;                                 // 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GameFramework.GameCrowdAgent.DisplayDebug
// [0x00420102] 
struct AGameCrowdAgent_execDisplayDebug_Params
{
	class AHUD*                                        HUD;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              out_YL;                                           // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_YPos;                                         // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	// class FString                                   T;                                                // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class UCanvas*                                  Canvas;                                           // 0x0018 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.Destroyed
// [0x00020102] 
struct AGameCrowdAgent_execDestroyed_Params
{
};

// Function GameFramework.GameCrowdAgent.ResetPooledAgent
// [0x00020002] 
struct AGameCrowdAgent_execResetPooledAgent_Params
{
};

// Function GameFramework.GameCrowdAgent.KillAgent
// [0x00020802] 
struct AGameCrowdAgent_eventKillAgent_Params
{
};

// Function GameFramework.GameCrowdAgent.PostBeginPlay
// [0x00820102] 
struct AGameCrowdAgent_execPostBeginPlay_Params
{
	// struct FVector                                  AgentScale3D;                                     // 0x0000 (0x000C) [0x0000000000000000]               
	// int32_t                                         I;                                                // 0x000C (0x0004) [0x0000000000000000]               
	// float                                           MaxSeePlayerDist;                                 // 0x0010 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.SetMaxSpeed
// [0x00020002] 
struct AGameCrowdAgent_execSetMaxSpeed_Params
{
};

// Function GameFramework.GameCrowdAgent.SetCurrentDestination
// [0x00020802] 
struct AGameCrowdAgent_eventSetCurrentDestination_Params
{
	class AGameCrowdDestination*                       NewDest;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.WaitForGroupMembers
// [0x00020802] 
struct AGameCrowdAgent_eventWaitForGroupMembers_Params
{
	// int32_t                                         I;                                                // 0x0000 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.PickBehaviorFrom
// [0x00824002] 
struct AGameCrowdAgent_execPickBehaviorFrom_Params
{
	class TArray<struct FBehaviorEntry>                BehaviorList;                                     // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FVector                                     BestCameraLoc;                                    // 0x000C (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  CameraLoc;                                        // 0x001C (0x000C) [0x0000000000000000]               
	// struct FRotator                                 CameraRot;                                        // 0x0028 (0x000C) [0x0000000000000000]               
	// class APlayerController*                        PC;                                               // 0x0034 (0x0004) [0x0000000000000000]               
	// float                                           BestDistSq;                                       // 0x0038 (0x0004) [0x0000000000000000]               
	// float                                           NewDistSq;                                        // 0x003C (0x0004) [0x0000000000000000]               
	// int32_t                                         I;                                                // 0x0040 (0x0004) [0x0000000000000000]               
	// float                                           FreqSum;                                          // 0x0044 (0x0004) [0x0000000000000000]               
	// float                                           RandPick;                                         // 0x0048 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.IsPanicked
// [0x00020400]  (iNative[34152])
struct AGameCrowdAgent_execIsPanicked_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgent.FellOutOfWorld
// [0x00020902] 
struct AGameCrowdAgent_eventFellOutOfWorld_Params
{
	class UClass*                                      dmgType;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.GetCollisionExtent
// [0x00020400]  (iNative[21666])
struct AGameCrowdAgent_execGetCollisionExtent_Params
{
	struct FVector                                     ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgentSkeletal.CreateAttachments
// [0x00020102] 
struct AGameCrowdAgentSkeletal_execCreateAttachments_Params
{
	// int32_t                                         AttachIdx;                                        // 0x0000 (0x0004) [0x0000000000000000]               
	// int32_t                                         InfoIdx;                                          // 0x0004 (0x0004) [0x0000000000000000]               
	// int32_t                                         PickedInfoIdx;                                    // 0x0008 (0x0004) [0x0000000000000000]               
	// float                                           ChanceTotal;                                      // 0x000C (0x0004) [0x0000000000000000]               
	// float                                           RandVal;                                          // 0x0010 (0x0004) [0x0000000000000000]               
	// class UStaticMeshComponent*                     StaticMeshComp;                                   // 0x0014 (0x0004) [0x0000000004000000] (CPF_EditInline)
	// uint32_t                                        bUseSocket : 1;                                   // 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	// uint32_t                                        bUseBone : 1;                                     // 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgentSkeletal.OnAnimEnd
// [0x00020802] 
struct AGameCrowdAgentSkeletal_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentSkeletal.StopIdleAnimation
// [0x00020902] 
struct AGameCrowdAgentSkeletal_eventStopIdleAnimation_Params
{
};

// Function GameFramework.GameCrowdAgentSkeletal.PlayIdleAnimation
// [0x00020902] 
struct AGameCrowdAgentSkeletal_eventPlayIdleAnimation_Params
{
};

// Function GameFramework.GameCrowdAgentSkeletal.ClearLatentAnimation
// [0x00020802] 
struct AGameCrowdAgentSkeletal_eventClearLatentAnimation_Params
{
};

// Function GameFramework.GameCrowdAgentSkeletal.OnPlayAgentAnimation
// [0x00020102] 
struct AGameCrowdAgentSkeletal_execOnPlayAgentAnimation_Params
{
	class USeqAct_PlayAgentAnimation*                  Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentSkeletal.SetRootMotion
// [0x00020400]  (iNative[34649])
struct AGameCrowdAgentSkeletal_execSetRootMotion_Params
{
	uint32_t                                           bRootMotionEnabled : 1;                           // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GameFramework.GameCrowdAgentSkeletal.PlayDeath
// [0x00020400]  (iNative[34460])
struct AGameCrowdAgentSkeletal_execPlayDeath_Params
{
