/*
#############################################################################################
# Guilty Gear Xrd Rev 2 (GGXRD-R2) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.5
# ========================================================================================= #
# File: REDGame_structs.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct REDGame.REDGameCommon_Define.SparringInformation
// 0x0014
struct FSparringInformation
{
	int32_t                                            Timer[2];                                      // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            PrevSeconds[2];                                // 0x0008 (0x0008) [0x0000000000000000]               
	uint32_t                                           bTimerCount : 1;                               // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct REDGame.Menu_DebugTop.DebugMenu
// 0x000C
struct FDebugMenu
{
	class FString                                      DebugMenuName;                                 // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct REDGame.REDAdvPresetCameraArray.PresetCameraItem
// 0x0024
struct FPresetCameraItem
{
	struct FVector                                     Location;                                      // 0x0000 (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     Rotation;                                      // 0x000C (0x000C) [0x0000000000000001] (CPF_Edit)    
	float                                              FOV;                                           // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class FName                                        SocketName;                                    // 0x001C (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct REDGame.REDSoundCueArray.SoundCueData
// 0x000C
struct FSoundCueData
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class USoundCue*                                   Cue;                                           // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct REDGame.REDAnimArray.AnimData
// 0x0010
struct FAnimData
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UREDAnimTree*                                AnimTree;                                      // 0x0008 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UAnimSet*                                    AnimSet;                                       // 0x000C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct REDGame.REDAnimNodeBlendLip.BlendLipKeyFrame
// 0x0008
struct FBlendLipKeyFrame
{
	int32_t                                            Pattern;                                       // 0x0000 (0x0004) [0x0000000000002000] (CPF_Transient)
	int32_t                                            frame;                                         // 0x0004 (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct REDGame.REDAnimNodeLimitedBlendSlot.SetAnimPosArgBackup
// 0x0010
struct FSetAnimPosArgBackup
{
	class FName                                        InAnimSeqName;                                 // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              InPosition;                                    // 0x0008 (0x0004) [0x0000000000000000]               
	uint32_t                                           bFireNotifies : 1;                             // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bLooping : 1;                                  // 0x000C (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bEnableRootMotion : 1;                         // 0x000C (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bSet : 1;                                      // 0x000C (0x0004) [0x0000000000000000] [0x00000008] 
};

// ScriptStruct REDGame.REDAnimNodeLookAtBattle.LookAtLinkSkelControl
// 0x0010
struct FLookAtLinkSkelControl
{
	class FName                                        ControlName;                                   // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              RotationLeft;                                  // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              RotationRight;                                 // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct REDGame.REDGameInfo.SpawnPlayerInfo
// 0x0064
struct FSpawnPlayerInfo
{
	uint8_t                                            PlayerID;                                      // 0x0000 (0x0001) [0x0000000000000000]               
	class FString                                      CharaID;                                       // 0x0004 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      EnemyCharaID;                                  // 0x0010 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            MeshID;                                        // 0x001C (0x0004) [0x0000000000000000]               
	int32_t                                            ColorID;                                       // 0x0020 (0x0004) [0x0000000000000000]               
	int32_t                                            VoiceID;                                       // 0x0024 (0x0004) [0x0000000000000000]               
	class FString                                      MeshIDString;                                  // 0x0028 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ColorIDString;                                 // 0x0034 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      DramaIDString;                                 // 0x0040 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      EnemyDramaIDString;                            // 0x004C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      VersionSuffix;                                 // 0x0058 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct REDGame.REDArcadeScript.EventLoadCharaList
// 0x0070
struct FEventLoadCharaList
{
	class FString                                      CharaID;                                       // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FSpawnPlayerInfo                            Info;                                          // 0x000C (0x0064) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct REDGame.REDArcadeScript.EventPresetCameraOffset
// 0x0018
struct FEventPresetCameraOffset
{
	class FString                                      CharaID;                                       // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FVector                                     offset;                                        // 0x000C (0x000C) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDArcadeScript.EventPlayingBGM
// 0x0010
struct FEventPlayingBGM
{
	class FString                                      Name;                                          // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class UAudioComponent*                             Component;                                     // 0x000C (0x0004) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
};

// ScriptStruct REDGame.REDBGMaterialController.FogDefaultParams
// 0x0008
struct FFogDefaultParams
{
	struct FColor                                      DefOppositeLightColor;                         // 0x0000 (0x0004) [0x0000000000000000]               
	struct FColor                                      DefLightInscatteringColor;                     // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDCameraShakePatterns.CameraShakeParam
// 0x000C
struct FCameraShakeParam
{
	class FName                                        PatternName;                                   // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UCameraShake*                                ShakePattern;                                  // 0x0008 (0x0004) [0x0000000004000001] (CPF_Edit | CPF_EditInline)
};

// ScriptStruct REDGame.REDCameraOffsetDataArray.CameraOffsetData
// 0x0018
struct FCameraOffsetData
{
	struct FVector                                     Position;                                      // 0x0000 (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FRotator                                    Rotation;                                      // 0x000C (0x000C) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct REDGame.REDCamera_Battle.PlayBattleCameraAnimInfo
// 0x0024
struct FPlayBattleCameraAnimInfo
{
	class UCameraAnim*                                 Anim;                                          // 0x0000 (0x0004) [0x0000000000000000]               
	class AREDPawn*                                    Pawn;                                          // 0x0004 (0x0004) [0x0000000000000000]               
	class AREDPawn*                                    LocCenterPawn;                                 // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            BlendInFrame;                                  // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            BlendOutFrame;                                 // 0x0010 (0x0004) [0x0000000000000000]               
	uint32_t                                           bMirrorX : 1;                                  // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bIsUpdateOrthoBlend : 1;                       // 0x0014 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bIsOrthoBlendTransversal : 1;                  // 0x0014 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bUseCenterPos : 1;                             // 0x0014 (0x0004) [0x0000000000000000] [0x00000008] 
	struct FVector                                     Center;                                        // 0x0018 (0x000C) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDCamera_Battle.MoveToPosInfo
// 0x009C
struct FMoveToPosInfo
{
	struct FTPOV                                       TargetPOV;                                     // 0x0000 (0x001C) [0x0000000000000000]               
	struct FTPOV                                       PrevPOV;                                       // 0x001C (0x001C) [0x0000000000000000]               
	struct FTPOV                                       LastPOV;                                       // 0x0038 (0x001C) [0x0000000000000000]               
	class AREDPawn*                                    PlayRequestPawn;                               // 0x0054 (0x0004) [0x0000000000000000]               
	class AREDPawn*                                    BasePawn;                                      // 0x0058 (0x0004) [0x0000000000000000]               
	class AREDPawn*                                    LookAtPawn;                                    // 0x005C (0x0004) [0x0000000000000000]               
	struct FVector                                     LookAtOffset;                                  // 0x0060 (0x000C) [0x0000000000000000]               
	int32_t                                            inFrame;                                       // 0x006C (0x0004) [0x0000000000000000]               
	int32_t                                            stayFrame;                                     // 0x0070 (0x0004) [0x0000000000000000]               
	int32_t                                            outFrame;                                      // 0x0074 (0x0004) [0x0000000000000000]               
	int32_t                                            FreezeFrame;                                   // 0x0078 (0x0004) [0x0000000000000000]               
	float                                              Distance;                                      // 0x007C (0x0004) [0x0000000000000000]               
	float                                              LookPosPercent;                                // 0x0080 (0x0004) [0x0000000000000000]               
	int32_t                                            State;                                         // 0x0084 (0x0004) [0x0000000000000000]               
	int32_t                                            InInterpType;                                  // 0x0088 (0x0004) [0x0000000000000000]               
	int32_t                                            OutInterpType;                                 // 0x008C (0x0004) [0x0000000000000000]               
	uint32_t                                           bBlendLastPOV : 1;                             // 0x0090 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            Counter;                                       // 0x0094 (0x0004) [0x0000000000000000]               
	uint32_t                                           bUpdateOrthoBlend : 1;                         // 0x0098 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bOrthoBlendTransversal : 1;                    // 0x0098 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct REDGame.REDCamera_Battle.EventCameraInfo
// 0x00C8
struct FEventCameraInfo
{
	struct FTPOV                                       PreFramePOV;                                   // 0x0000 (0x001C) [0x0000000000000000]               
	struct FTPOV                                       TargetPOV;                                     // 0x001C (0x001C) [0x0000000000000000]               
	struct FTPOV                                       StartPOV;                                      // 0x0038 (0x001C) [0x0000000000000000]               
	int32_t                                            Count;                                         // 0x0054 (0x0004) [0x0000000000000000]               
	int32_t                                            CountMax;                                      // 0x0058 (0x0004) [0x0000000000000000]               
	int32_t                                            ShakeCount;                                    // 0x005C (0x0004) [0x0000000000000000]               
	int32_t                                            ShakeCountMax;                                 // 0x0060 (0x0004) [0x0000000000000000]               
	struct FVector                                     Shake;                                         // 0x0064 (0x000C) [0x0000000000000000]               
	uint32_t                                           ShakeFadeout : 1;                              // 0x0070 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FRotator                                    RotateStart;                                   // 0x0074 (0x000C) [0x0000000000000000]               
	struct FRotator                                    RotateEnd;                                     // 0x0080 (0x000C) [0x0000000000000000]               
	int32_t                                            RotateCount;                                   // 0x008C (0x0004) [0x0000000000000000]               
	int32_t                                            RotateCountMax;                                // 0x0090 (0x0004) [0x0000000000000000]               
	struct FVector                                     MoveStart;                                     // 0x0094 (0x000C) [0x0000000000000000]               
	struct FVector                                     MoveEnd;                                       // 0x00A0 (0x000C) [0x0000000000000000]               
	int32_t                                            MoveCount;                                     // 0x00AC (0x0004) [0x0000000000000000]               
	int32_t                                            MoveCountMax;                                  // 0x00B0 (0x0004) [0x0000000000000000]               
	uint32_t                                           IsWorldLocation : 1;                           // 0x00B4 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              FOVStart;                                      // 0x00B8 (0x0004) [0x0000000000000000]               
	float                                              FOVEnd;                                        // 0x00BC (0x0004) [0x0000000000000000]               
	int32_t                                            FOVCount;                                      // 0x00C0 (0x0004) [0x0000000000000000]               
	int32_t                                            FOVCountMax;                                   // 0x00C4 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDCamera_Battle.PlayCameraAnimInfo
// 0x0018
struct FPlayCameraAnimInfo
{
	class AREDPawn*                                    CenterPawn;                                    // 0x0000 (0x0004) [0x0000000000000000]               
	class UCameraAnimInst*                             CurrentCamAnimInst;                            // 0x0004 (0x0004) [0x0000000000000000]               
	struct FVector                                     centerLocation;                                // 0x0008 (0x000C) [0x0000000000000000]               
	uint32_t                                           bUseCenterLocation : 1;                        // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bUpdateOrthoBlend : 1;                         // 0x0014 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bOrthoBlendTransversal : 1;                    // 0x0014 (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct REDGame.REDCamera_Battle.FixedCameraInfo
// 0x001C
struct FFixedCameraInfo
{
	struct FTPOV                                       FixedPOV;                                      // 0x0000 (0x001C) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDCamera_Battle.CameraMoveToPosArg
// 0x0058
struct FCameraMoveToPosArg
{
	class AREDPawn*                                    PlayRequestPawn;                               // 0x0000 (0x0004) [0x0000000000000000]               
	class AREDPawn*                                    BasePawn;                                      // 0x0004 (0x0004) [0x0000000000000000]               
	class AREDPawn*                                    LookAtPawn;                                    // 0x0008 (0x0004) [0x0000000000000000]               
	struct FVector                                     BaseOffset;                                    // 0x000C (0x000C) [0x0000000000000000]               
	struct FRotator                                    BaseRot;                                       // 0x0018 (0x000C) [0x0000000000000000]               
	struct FVector                                     LookAtOffset;                                  // 0x0024 (0x000C) [0x0000000000000000]               
	float                                              FOV;                                           // 0x0030 (0x0004) [0x0000000000000000]               
	int32_t                                            inFrame;                                       // 0x0034 (0x0004) [0x0000000000000000]               
	int32_t                                            stayFrame;                                     // 0x0038 (0x0004) [0x0000000000000000]               
	int32_t                                            outFrame;                                      // 0x003C (0x0004) [0x0000000000000000]               
	int32_t                                            FreezeFrame;                                   // 0x0040 (0x0004) [0x0000000000000000]               
	float                                              Distance;                                      // 0x0044 (0x0004) [0x0000000000000000]               
	float                                              LookPosPercent;                                // 0x0048 (0x0004) [0x0000000000000000]               
	int32_t                                            InInterpType;                                  // 0x004C (0x0004) [0x0000000000000000]               
	int32_t                                            OutInterpType;                                 // 0x0050 (0x0004) [0x0000000000000000]               
	uint32_t                                           bMirrorX : 1;                                  // 0x0054 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bUpdateOrthoBlend : 1;                         // 0x0054 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bOrthoBlendTransversal : 1;                    // 0x0054 (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct REDGame.REDCameraAnimArray.CameraAnimData
// 0x000C
struct FCameraAnimData
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UCameraAnim*                                 Anim;                                          // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct REDGame.REDPawnMaterials.UseMaterialInstance
// 0x0008
struct FUseMaterialInstance
{
	class UMaterialInterface*                          MaterialInstance;                              // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            CategoryFlag;                                  // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDPawnMaterials.MaterialSetArrayPair
// 0x000C
struct FMaterialSetArrayPair
{
	class FName                                        PatternName;                                   // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UREDMaterialSetArray*                        MaterialSetArray;                              // 0x0008 (0x0004) [0x0000000004000001] (CPF_Edit | CPF_EditInline)
};

// ScriptStruct REDGame.REDPawn.MeshSet
// 0x008C
struct FMeshSet
{
	class FName                                        SetName;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	class FName                                        MeshNames[16];                                 // 0x0008 (0x0080) [0x0000000000000000]               
	int32_t                                            MeshNameNum;                                   // 0x0088 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDPawn.PlayerExGaugeParam
// 0x0015
struct FPlayerExGaugeParam
{
	uint32_t                                           bActive : 1;                                   // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bPreActive : 1;                                // 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	int32_t                                            IconID;                                        // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            MaxVal;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            val;                                           // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            Color;                                         // 0x0010 (0x0004) [0x0000000000000000]               
	uint8_t                                            DispMode;                                      // 0x0014 (0x0001) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDPawn.FaceBlendControl
// 0x000C
struct FFaceBlendControl
{
	class USkeletalMeshComponent*                      LinkSKMesh;                                    // 0x0000 (0x0004) [0x0000000004180008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class UREDAnimNodeBlendLip*                        AnimLip;                                       // 0x0004 (0x0004) [0x0000000000100000]               
	class UREDAnimNodeBlendEyeBlink*                   AnimBlink;                                     // 0x0008 (0x0004) [0x0000000000100000]               
};

// ScriptStruct REDGame.REDPawn.MeshControl
// 0x0070
struct FMeshControl
{
	class USkeletalMeshComponent*                      TargetMesh;                                    // 0x0000 (0x0004) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class UMaterialInstanceConstant*                   BaseMatInst;                                   // 0x0004 (0x0004) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   ShadowMatInst;                                 // 0x0008 (0x0004) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   OutlineMatInst;                                // 0x000C (0x0004) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   DecalMatInst;                                  // 0x0010 (0x0004) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   SpecularMatInst;                               // 0x0014 (0x0004) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   UniqueAMatInst;                                // 0x0018 (0x0004) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   UniqueBMatInst;                                // 0x001C (0x0004) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   UniqueCMatInst;                                // 0x0020 (0x0004) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   DmgDecalAMatInst;                              // 0x0024 (0x0004) [0x0000000000000000]               
	class UMaterialInstanceConstant*                   DmgDecalBMatInst;                              // 0x0028 (0x0004) [0x0000000000000000]               
	int32_t                                            MaterialCategories[10];                        // 0x002C (0x0028) [0x0000000000000000]               
	class UREDAnimNodeBlendList*                       AnimList;                                      // 0x0054 (0x0004) [0x0000000000000000]               
	class UREDAnimNodeSequence*                        AnimSeq;                                       // 0x0058 (0x0004) [0x0000000000000000]               
	class FName                                        MeshPartsName;                                 // 0x005C (0x0008) [0x0000000000000000]               
	class FName                                        AnimDataName;                                  // 0x0064 (0x0008) [0x0000000000000000]               
	uint32_t                                           DefaultDispOn : 1;                             // 0x006C (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bDispThisFrame : 1;                            // 0x006C (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bFoundAnime : 1;                               // 0x006C (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct REDGame.REDParticle.ParticleDatabase
// 0x000C
struct FParticleDatabase
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UParticleSystem*                             PSTemplate;                                    // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct REDGame.REDParticle.ParticleArg
// 0x006C
struct FParticleArg
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000000]               
	struct FVector                                     Location;                                      // 0x0008 (0x000C) [0x0000000000000000]               
	struct FRotator                                    Rotate;                                        // 0x0014 (0x000C) [0x0000000000000000]               
	struct FVector                                     Scale;                                         // 0x0020 (0x000C) [0x0000000000000000]               
	class AREDPawn*                                    Pawn;                                          // 0x002C (0x0004) [0x0000000000000000]               
	class AREDPawn_Player*                             PlayerPawn;                                    // 0x0030 (0x0004) [0x0000000000000000]               
	struct FLinearColor                                AddColor;                                      // 0x0034 (0x0010) [0x0000000000000000]               
	struct FLinearColor                                MulColor;                                      // 0x0044 (0x0010) [0x0000000000000000]               
	struct FPointer                                    LinkObjPtr;                                    // 0x0054 (0x0004) [0x0000000000001000] (CPF_Native)  
	class FName                                        SocketName;                                    // 0x0058 (0x0008) [0x0000000000000000]               
	int32_t                                            TransPriority;                                 // 0x0060 (0x0004) [0x0000000000000000]               
	uint32_t                                           bUseSocket : 1;                                // 0x0064 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bWithSocketRot : 1;                            // 0x0064 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bUsePlayerSocket : 1;                          // 0x0064 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bLinkObj : 1;                                  // 0x0064 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bMirrorX : 1;                                  // 0x0064 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bSetAddColor : 1;                              // 0x0064 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bSetMulColor : 1;                              // 0x0064 (0x0004) [0x0000000000000000] [0x00000040] 
	int32_t                                            StartFrame;                                    // 0x0068 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDPawn.LocalMaterialPool
// 0x0324
struct FLocalMaterialPool
{
	class UMaterialInstanceConstant*                   MaterialInstances[100];                        // 0x0000 (0x0190) [0x0000000000000000]               
	int32_t                                            CategoryFlags[100];                            // 0x0190 (0x0190) [0x0000000000000000]               
	int32_t                                            MaterialInstancesNum;                          // 0x0320 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDEasyCharaSelectActor.CharaData
// 0x001C
struct FCharaData
{
	uint8_t                                            CharaID;                                       // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            MeshID;                                        // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            ColorID;                                       // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class FString                                      FileColorID;                                   // 0x000C (0x000C) [0x0000000000420001] (CPF_Edit | CPF_EditConst | CPF_NeedCtorLink)
	int32_t                                            VoiceID;                                       // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct REDGame.REDEffect.EffectSkeletalMeshData
// 0x0014
struct FEffectSkeletalMeshData
{
	class FName                                        Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UREDMeshArray*                               MeshArray;                                     // 0x0008 (0x0004) [0x0000000004000001] (CPF_Edit | CPF_EditInline)
	class UREDAnimArray*                               AnimArray;                                     // 0x000C (0x0004) [0x0000000004000001] (CPF_Edit | CPF_EditInline)
	class UREDPawnMaterials*                           PawnMaterial;                                  // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct REDGame.REDEffectMaterialInfo.EffectPawnMaterialInfo
// 0x000C
struct FEffectPawnMaterialInfo
{
	class FName                                        EffectName;                                    // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UREDPawnMaterials*                           Materials;                                     // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct REDGame.REDEffectPawnPool.PawnUpdateGlobalMaterialParam
// 0x0010
struct FPawnUpdateGlobalMaterialParam
{
	struct FVector                                     cameraVector;                                  // 0x0000 (0x000C) [0x0000000000000000]               
	float                                              FovTan;                                        // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameCommon_PlayerInfo.PlayerInfo_EnemyTable
// 0x0014
struct FPlayerInfo_EnemyTable
{
	class FString                                      EnemyID;                                       // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            BGID;                                          // 0x000C (0x0001) [0x0000000000000000]               
	uint8_t                                            BGM_ID;                                        // 0x000D (0x0001) [0x0000000000000000]               
	uint32_t                                           bDrama : 1;                                    // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bBoss : 1;                                     // 0x0010 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bDarkColor : 1;                                // 0x0010 (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct REDGame.REDGameCommon_PlayerInfo.PlayerInfo_ArcadeInfoTable
// 0x00C2
struct FPlayerInfo_ArcadeInfoTable
{
	class FString                                      CharaID;                                       // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FPlayerInfo_EnemyTable                      Enemy[9];                                      // 0x000C (0x00B4) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            INTDType[2];                                   // 0x00C0 (0x0002) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameCommon_PlayerInfo.PlayerInfo_ArcadeDramaRes
// 0x01BC
struct FPlayerInfo_ArcadeDramaRes
{
	class FString                                      CharaID;                                       // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Package1[9];                                   // 0x000C (0x006C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Package2[9];                                   // 0x0078 (0x006C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Package3[9];                                   // 0x00E4 (0x006C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Package4[9];                                   // 0x0150 (0x006C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct REDGame.REDGameCommon_PlayerInfo.PlayerInfo_ArcadeDramaTable
// 0x019C
struct FPlayerInfo_ArcadeDramaTable
{
	class FString                                      CharaID;                                       // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FPlayerInfo_EnemyTable                      Info[20];                                      // 0x000C (0x0190) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct REDGame.REDGameCommon_PlayerInfo.PlayerInfo_CharaChainTabel
// 0x000E
struct FPlayerInfo_CharaChainTabel
{
	class FString                                      CharaID;                                       // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            BGID;                                          // 0x000C (0x0001) [0x0000000000000000]               
	uint8_t                                            BGM_ID;                                        // 0x000D (0x0001) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameCommon_PlayerInfo.PlayerInfo_ExcludeRandom
// 0x0048
struct FPlayerInfo_ExcludeRandom
{
	class FString                                      CharaID;                                       // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ExcludeID[5];                                  // 0x000C (0x003C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct REDGame.REDGameCommon_PlayerInfo.PlayerInfo_MOMInfo
// 0x0004
struct FPlayerInfo_MOMInfo
{
	uint32_t                                           bRannyuInBattle : 1;                           // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct REDGame.REDGameCommon.ColorOrderInfo
// 0x008C
struct FColorOrderInfo
{
	class FString                                      CharaID;                                       // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Color[32];                                     // 0x000C (0x0080) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGfxMoviePlayer_MenuStageSelect.BGSelectItem
// 0x0030
struct FBGSelectItem
{
	uint8_t                                            Id;                                            // 0x0000 (0x0001) [0x0000000000000000]               
	uint32_t                                           bRandom : 1;                                   // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bDefault : 1;                                  // 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FRotator                                    GlobeRot;                                      // 0x0008 (0x000C) [0x0000000000000000]               
	class FName                                        Narration;                                     // 0x0014 (0x0008) [0x0000000000000000]               
	class FString                                      CharaID;                                       // 0x001C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            IDForUI;                                       // 0x0028 (0x0004) [0x0000000000000000]               
	int32_t                                            MarkerID;                                      // 0x002C (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGfxMoviePlayer_MenuStageSelect.BGMSelectItem
// 0x0014
struct FBGMSelectItem
{
	uint8_t                                            Id;                                            // 0x0000 (0x0001) [0x0000000000000000]               
	uint32_t                                           bRandom : 1;                                   // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bDefault : 1;                                  // 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
	class FString                                      CharaID;                                       // 0x0008 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct REDGame.REDGameInfo_Battle.MatchResultWindowArg
// 0x0054
struct FMatchResultWindowArg
{
	uint32_t                                           bDisp : 1;                                     // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bPromote : 1;                                  // 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bDemote : 1;                                   // 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bDispMedal : 1;                                // 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bDispMedalOnly : 1;                            // 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	class FString                                      PlayerName;                                    // 0x0004 (0x000C) [0x0000000000500000] (CPF_NeedCtorLink)
	int32_t                                            TotalCount;                                    // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            WinCount;                                      // 0x0014 (0x0004) [0x0000000000000000]               
	int32_t                                            LoseCount;                                     // 0x0018 (0x0004) [0x0000000000000000]               
	int32_t                                            PreRank;                                       // 0x001C (0x0004) [0x0000000000000000]               
	int32_t                                            Rank;                                          // 0x0020 (0x0004) [0x0000000000000000]               
	int32_t                                            Level;                                         // 0x0024 (0x0004) [0x0000000000000000]               
	int32_t                                            NowExp;                                        // 0x0028 (0x0004) [0x0000000000000000]               
	int32_t                                            FinalExp;                                      // 0x002C (0x0004) [0x0000000000000000]               
	int32_t                                            MedalNum[4];                                   // 0x0030 (0x0010) [0x0000000000000000]               
	int32_t                                            Score;                                         // 0x0040 (0x0004) [0x0000000000000000]               
	uint32_t                                           bWin : 1;                                      // 0x0044 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            cpuRank;                                       // 0x0048 (0x0004) [0x0000000000000000]               
	int32_t                                            cpuLevelAddVal;                                // 0x004C (0x0004) [0x0000000000000000]               
	uint32_t                                           bRankTestFinish : 1;                           // 0x0050 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bAmulet_RankDownCheck : 1;                     // 0x0050 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bAmulet_Disp : 1;                              // 0x0050 (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct REDGame.REDGameInfo_LobbyBase.Lobby_Collision_Event
// 0x0018
struct FLobby_Collision_Event
{
	uint8_t                                            Event;                                         // 0x0000 (0x0001) [0x0000000000000000]               
	int32_t                                            OptionData;                                    // 0x0004 (0x0004) [0x0000000000000000]               
	struct FVector2D                                   pos;                                           // 0x0008 (0x0008) [0x0000000000000000]               
	float                                              Radius;                                        // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              Angle;                                         // 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameInfo_LobbyBase.Lobby_KyoutaiInfo
// 0x0018
struct FLobby_KyoutaiInfo
{
	struct FVector2D                                   pos;                                           // 0x0000 (0x0008) [0x0000000000000000]               
	struct FVector2D                                   LeavePos;                                      // 0x0008 (0x0008) [0x0000000000000000]               
	float                                              Angle;                                         // 0x0010 (0x0004) [0x0000000000000000]               
	uint32_t                                           bSansaki : 1;                                  // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct REDGame.REDGameInfo_LobbyBase.Lobby_WaitLineInfo
// 0x0090
struct FLobby_WaitLineInfo
{
	struct FLobby_KyoutaiInfo                          Infos[6];                                      // 0x0000 (0x0090) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameInfo_LobbyBase.Lobby_Collision_Wall
// 0x0020
struct FLobby_Collision_Wall
{
	struct FVector2D                                   Pos1;                                          // 0x0000 (0x0008) [0x0000000000000000]               
	struct FVector2D                                   Pos2;                                          // 0x0008 (0x0008) [0x0000000000000000]               
	float                                              Thickness;                                     // 0x0010 (0x0004) [0x0000000000000000]               
	uint32_t                                           bCheckMoveLine : 1;                            // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FVector2D                                   Normal;                                        // 0x0018 (0x0008) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameInfo_LobbyBase.Lobby_Collision_Circle
// 0x0010
struct FLobby_Collision_Circle
{
	uint8_t                                            Event;                                         // 0x0000 (0x0001) [0x0000000000000000]               
	struct FVector2D                                   pos;                                           // 0x0004 (0x0008) [0x0000000000000000]               
	float                                              Radius;                                        // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameInfo_LobbyBase.Lobby_Collision_Rect
// 0x0034
struct FLobby_Collision_Rect
{
	struct FVector2D                                   Center;                                        // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Radius;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              MinRadius;                                     // 0x000C (0x0004) [0x0000000000000000]               
	float                                              MaxRadius;                                     // 0x0010 (0x0004) [0x0000000000000000]               
	struct FVector2D                                   pos[4];                                        // 0x0014 (0x0020) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameInfo_LobbyBase.Lobby_Collision_Floor
// 0x003C
struct FLobby_Collision_Floor
{
	struct FVector2D                                   Center;                                        // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              Radius;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	struct FVector                                     pos[4];                                        // 0x000C (0x0030) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameInfo_LobbyBase.Lobby_KyoutaiMaterial
// 0x0014
struct FLobby_KyoutaiMaterial
{
	class UMaterialInterface*                          Normal;                                        // 0x0000 (0x0004) [0x0000000000000000]               
	class UMaterialInterface*                          Reserve;                                       // 0x0004 (0x0004) [0x0000000000000000]               
	class UMaterialInterface*                          BattleOK;                                      // 0x0008 (0x0004) [0x0000000000000000]               
	class UMaterialInterface*                          Battle;                                        // 0x000C (0x0004) [0x0000000000000000]               
	class UMaterialInterface*                          NoUse;                                         // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameOnlineLobbyInterfaceSteamworks.LobbySetting
// 0x0018
struct FLobbySetting
{
	class FString                                      Key;                                           // 0x0000 (0x000C) [0x0000000000500000] (CPF_NeedCtorLink)
	class FString                                      Value;                                         // 0x000C (0x000C) [0x0000000000500000] (CPF_NeedCtorLink)
};

// ScriptStruct REDGame.REDGameOnlineLobbyInterfaceSteamworks.FindLobbyFilter
// 0x0020
struct FFindLobbyFilter
{
	class FString                                      Key;                                           // 0x0000 (0x000C) [0x0000000000500000] (CPF_NeedCtorLink)
	class FString                                      Value;                                         // 0x000C (0x000C) [0x0000000000500000] (CPF_NeedCtorLink)
	uint8_t                                            Operator;                                      // 0x0018 (0x0001) [0x0000000000000000]               
	uint32_t                                           bNumeric : 1;                                  // 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct REDGame.REDGameOnlineLobbyInterfaceSteamworks.FoundLobby
// 0x0014
struct FFoundLobby
{
	struct FUniqueNetId                                LobbyUID;                                      // 0x0000 (0x0008) [0x0000000000000000]               
	class TArray<struct FLobbySetting>                 LobbySettings;                                 // 0x0008 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct REDGame.REDGameStatsBase.AchievementData
// 0x000C
struct FAchievementData
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            StatsID;                                       // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            Criteria;                                      // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGameStatsBase.StatsData
// 0x000C
struct FStatsData
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                            StatsType;                                     // 0x0004 (0x0001) [0x0000000000000000]               
	int32_t                                            Value;                                         // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGfxMovieArray.MoviePlayerClassData
// 0x0028
struct FMoviePlayerClassData
{
	class FString                                      Name;                                          // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ClassName;                                     // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      MovieName;                                     // 0x0018 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           UseREDGame : 1;                                // 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct REDGame.REDGfxMovieManager_BattleHUD.BattleHUD_PreFrameData
// 0x0022
struct FBattleHUD_PreFrameData
{
	float                                              HP[2];                                         // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              RedHP[2];                                      // 0x0008 (0x0008) [0x0000000000000000]               
	float                                              WhiteHP[2];                                    // 0x0010 (0x0008) [0x0000000000000000]               
	float                                              Burst[2];                                      // 0x0018 (0x0008) [0x0000000000000000]               
	uint8_t                                            GuardBalanceCH[2];                             // 0x0020 (0x0002) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGfxMoviePlayer_BattleDownside.TensionGaugeMC
// 0x0040
struct FTensionGaugeMC
{
	class UGFxObject*                                  rootMC;                                        // 0x0000 (0x0004) [0x0000000000000000]               
	class UGFxObject*                                  GaugeAllMC;                                    // 0x0004 (0x0004) [0x0000000000000000]               
	class UGFxObject*                                  gaugeBlkMC;                                    // 0x0008 (0x0004) [0x0000000000000000]               
	class UGFxObject*                                  gaugeMainMC;                                   // 0x000C (0x0004) [0x0000000000000000]               
	class UGFxObject*                                  tFlashMC;                                      // 0x0010 (0x0004) [0x0000000000000000]               
	class UGFxObject*                                  gaugeCoverMC;                                  // 0x0014 (0x0004) [0x0000000000000000]               
	class UGFxObject*                                  TBalanceMC;                                    // 0x0018 (0x0004) [0x0000000000000000]               
	class UGFxObject*                                  burstThunderMC;                                // 0x001C (0x0004) [0x0000000000000000]               
	uint8_t                                            TensionState;                                  // 0x0020 (0x0001) [0x0000000000000000]               
	uint8_t                                            NextTensionState;                              // 0x0021 (0x0001) [0x0000000000000000]               
	int32_t                                            Tension;                                       // 0x0024 (0x0004) [0x0000000000000000]               
	int32_t                                            PreTension;                                    // 0x0028 (0x0004) [0x0000000000000000]               
	float                                              TensBalanceAddX;                               // 0x002C (0x0004) [0x0000000000000000]               
	uint32_t                                           TensColTrg : 1;                                // 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            TensColMul;                                    // 0x0034 (0x0004) [0x0000000000000000]               
	int32_t                                            TensColAdd;                                    // 0x0038 (0x0004) [0x0000000000000000]               
	int32_t                                            TensColorIndex;                                // 0x003C (0x0004) [0x0000000000000000]               
};

// ScriptStruct REDGame.REDGfxMoviePlayer_BattleDownside.DangerTimeMC
// 0x001C
struct FDangerTimeMC
{
	class UGFxObject*                                  DangerTimerMC;                                 // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            DangerTime;                                    // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            DangerTimePreFrame;                            // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            DangerAnimCounter;                             // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            DangerAnimCounterMax;                          // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            DangerColorRed;                                // 0x0014 (0x0004) [0x0000000000000000]               
	uint32_t                                           IsDangerTime : 1;                              // 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           DangerDamageTrg1P : 1;                         // 0x0018 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           DangerDamageTrg2P : 1;                         // 0x0018 (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct REDGame.REDGfxMoviePlayer_BattleDownside.ExGaugeMC
// 0x0024
struct FExGaugeMC
{
	class UGFxObject*                                  rootMC;                                        // 0x0000 (0x0004) [0x0000000000000000]               
