/*
#############################################################################################
# Guilty Gear Xrd Rev 2 (GGXRD-R2) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.5
# ========================================================================================= #
# File: REDGame_parameters.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function REDGame.REDActor_CheckDOF.Tick
// [0x00020802] 
struct AREDActor_CheckDOF_eventTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_CheckDOF.SetDOFInfoPositionNative
// [0x00020400]  (iNative[39736])
struct AREDActor_CheckDOF_execSetDOFInfoPositionNative_Params
{
	float                                              InnerRadius;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Position;                                         // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_CheckDOF.SetDOFInfoDistanceNative
// [0x00020400]  (iNative[39734])
struct AREDActor_CheckDOF_execSetDOFInfoDistanceNative_Params
{
	float                                              InnerRadius;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Distance;                                         // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_CheckDOF.SetDOFInfoFocusTypeNative
// [0x00020400]  (iNative[39735])
struct AREDActor_CheckDOF_execSetDOFInfoFocusTypeNative_Params
{
	uint8_t                                            Type;                                             // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_CheckDOF.SetDOFInfo
// [0x00020002] 
struct AREDActor_CheckDOF_execSetDOFInfo_Params
{
	float                                              InnerRadius;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Distance;                                         // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_CheckDOF.SetupCamera
// [0x00020002] 
struct AREDActor_CheckDOF_execSetupCamera_Params
{
	// class AREDPlayerController*                     PC;                                               // 0x0000 (0x0004) [0x0000000000000000]               
	// class AREDCamera*                               Cam;                                              // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDActor_CheckDOF.NativeTick
// [0x00020400]  (iNative[38513])
struct AREDActor_CheckDOF_execNativeTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_GlareEffect.Initialize
// [0x00020002] 
struct AREDActor_GlareEffect_execInitialize_Params
{
	int32_t                                            Index;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AREDSceneColorSettings*                      Settings;                                         // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_GlareEffect.UpdateMaterialParameter
// [0x00020401]  (iNative[40776])
struct AREDActor_GlareEffect_execUpdateMaterialParameter_Params
{
};

// Function REDGame.REDActor_GlareEffect.UpdateTransform
// [0x00420401]  (iNative[40877])
struct AREDActor_GlareEffect_execUpdateTransform_Params
{
	struct FTPOV                                       POV;                                              // 0x0000 (0x001C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
};

// Function REDGame.REDActor_GlareEffect.UpdateParameter
// [0x00020401]  (iNative[40800])
struct AREDActor_GlareEffect_execUpdateParameter_Params
{
};

// Function REDGame.REDActor_GlareEffect.SetAlphaToF
// [0x00020401]  (iNative[39688])
struct AREDActor_GlareEffect_execSetAlphaToF_Params
{
	float                                              StartAlpha;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              EndAlpha;                                         // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            frame;                                            // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_GlareEffect.SetAlphaTo
// [0x00020401]  (iNative[39687])
struct AREDActor_GlareEffect_execSetAlphaTo_Params
{
	int32_t                                            StartAlpha;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            EndAlpha;                                         // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            frame;                                            // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_GlareEffect.SetAlpha
// [0x00020401]  (iNative[39685])
struct AREDActor_GlareEffect_execSetAlpha_Params
{
	int32_t                                            inAlpha;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_GlareEffect.SetAlphaF
// [0x00020401]  (iNative[39686])
struct AREDActor_GlareEffect_execSetAlphaF_Params
{
	float                                              inAlpha;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_GlareEffect.SetColor
// [0x00420401]  (iNative[39711])
struct AREDActor_GlareEffect_execSetColor_Params
{
	struct FColor                                      InColor;                                          // 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
};

// Function REDGame.REDActor_GlareEffect.SetColorF
// [0x00420401]  (iNative[39712])
struct AREDActor_GlareEffect_execSetColorF_Params
{
	struct FLinearColor                                InColor;                                          // 0x0000 (0x0010) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
};

// Function REDGame.REDActor_GlareEffect.ResetColor
// [0x00020401]  (iNative[27181])
struct AREDActor_GlareEffect_execResetColor_Params
{
};

// Function REDGame.REDActor_GlareEffect.SetScale
// [0x00020401]  (iNative[28132])
struct AREDActor_GlareEffect_execSetScale_Params
{
	float                                              X;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Y;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_GlareEffect.SetDisp
// [0x00020401]  (iNative[39728])
struct AREDActor_GlareEffect_execSetDisp_Params
{
	uint32_t                                           bDispOn : 1;                                      // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function REDGame.REDActor_GlareEffect.SetOffset
// [0x00020401]  (iNative[39786])
struct AREDActor_GlareEffect_execSetOffset_Params
{
	float                                              X;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Y;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_PauseMenu.Tick
// [0x00020802] 
struct AREDActor_PauseMenu_eventTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_PauseMenu.UnPause
// [0x00020802] 
struct AREDActor_PauseMenu_eventUnPause_Params
{
};

// Function REDGame.REDActor_PauseMenu.ActivatePause
// [0x00020002] 
struct AREDActor_PauseMenu_execActivatePause_Params
{
	class AREDHUD*                                     HUD;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDActor_PauseMenu.PauseUpdate
// [0x00020400]  (iNative[38905])
struct AREDActor_PauseMenu_execPauseUpdate_Params
{
};

// Function REDGame.REDActor_PostUpdater.Tick
// [0x00020802] 
struct AREDActor_PostUpdater_eventTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_PostUpdater.UpdateMaterialParam
// [0x00020400]  (iNative[40774])
struct AREDActor_PostUpdater_execUpdateMaterialParam_Params
{
};

// Function REDGame.REDActor_RadialBlur.Tick
// [0x00020802] 
struct AREDActor_RadialBlur_eventTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_RadialBlur.PostBeginPlay
// [0x00020002] 
struct AREDActor_RadialBlur_execPostBeginPlay_Params
{
};

// Function REDGame.REDActor_RadialBlur.SetupCamera
// [0x00020002] 
struct AREDActor_RadialBlur_execSetupCamera_Params
{
	// class AREDPlayerController*                     PC;                                               // 0x0000 (0x0004) [0x0000000000000000]               
	// class AREDCamera*                               Cam;                                              // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDActor_RadialBlur.UpdateDraw
// [0x00020401]  (iNative[40649])
struct AREDActor_RadialBlur_execUpdateDraw_Params
{
};

// Function REDGame.REDActor_RadialBlur.NativeTick
// [0x00020401]  (iNative[38513])
struct AREDActor_RadialBlur_execNativeTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDActor_RadialBlur.End
// [0x00020401]  (iNative[20356])
struct AREDActor_RadialBlur_execEnd_Params
{
	uint32_t                                           immediate : 1;                                    // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function REDGame.REDActor_RadialBlur.Start
// [0x00020401]  (iNative[13142])
struct AREDActor_RadialBlur_execStart_Params
{
	struct FVector                                     centerLocation;                                   // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bRelativeCamera : 1;                              // 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              Scale;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Opacity;                                          // 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Falloff;                                          // 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            inTime;                                           // 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            stayTime;                                         // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            outTime;                                          // 0x0024 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAdvSceneData.GetSECue
// [0x00020400]  (iNative[37165])
struct UREDAdvSceneData_execGetSECue_Params
{
	class FName                                        cueName;                                          // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class USoundCue*                                   ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDAnimNodeBlendList.ChangeAnimSeq
// [0x00020400]  (iNative[36090])
struct UREDAnimNodeBlendList_execChangeAnimSeq_Params
{
	class FName                                        SeqName;                                          // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           isLoop : 1;                                       // 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              StartTime;                                        // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              BlendTime;                                        // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UREDAnimNodeSequence*                        ReturnValue;                                      // 0x0014 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDAnimNodeBlendAdvFace.UpdateBlendAnim
// [0x00020400]  (iNative[40604])
struct UREDAnimNodeBlendAdvFace_execUpdateBlendAnim_Params
{
};

// Function REDGame.REDAnimNodeBlendAdvFace.ChangeFace
// [0x00020400]  (iNative[36096])
struct UREDAnimNodeBlendAdvFace_execChangeFace_Params
{
	int32_t                                            InFaceType;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            InBlendCount;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            InBlendInterval;                                  // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            InAcc;                                            // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDAnimNodeBlendAdvHair.UpdateBlendAnim
// [0x00020400]  (iNative[40604])
struct UREDAnimNodeBlendAdvHair_execUpdateBlendAnim_Params
{
};

// Function REDGame.REDAnimNodeBlendAdvHair.SetHair
// [0x00020400]  (iNative[39754])
struct UREDAnimNodeBlendAdvHair_execSetHair_Params
{
	class FString                                      AnimName;                                         // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            InBlendCount;                                     // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            InBlendInterval;                                  // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            InAcc;                                            // 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           isLoop : 1;                                       // 0x0018 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           IsForceSet : 1;                                   // 0x001C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDAnimNodeBlendEyeBlink.Update
// [0x00020400]  (iNative[13049])
struct UREDAnimNodeBlendEyeBlink_execUpdate_Params
{
};

// Function REDGame.REDAnimNodeBlendEyeBlink.StopBlink
// [0x00020400]  (iNative[40099])
struct UREDAnimNodeBlendEyeBlink_execStopBlink_Params
{
};

// Function REDGame.REDAnimNodeBlendEyeBlink.PlayBlink
// [0x00024400]  (iNative[38963])
struct UREDAnimNodeBlendEyeBlink_execPlayBlink_Params
{
	uint32_t                                           Linear : 1;                                       // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              Speed;                                            // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            playFrame;                                        // 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function REDGame.REDAnimNodeBlendEyeBlink.SetBlendTarget
// [0x00020400]  (iNative[27891])
struct UREDAnimNodeBlendEyeBlink_execSetBlendTarget_Params
{
	float                                              BlendTarget;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              BlendTime;                                        // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeBlendLip.Update
// [0x00020400]  (iNative[13049])
struct UREDAnimNodeBlendLip_execUpdate_Params
{
};

// Function REDGame.REDAnimNodeBlendLip.ChangeMouthSeqNodeIndex
// [0x00020400]  (iNative[36103])
struct UREDAnimNodeBlendLip_execChangeMouthSeqNodeIndex_Params
{
	int32_t                                            Index;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeBlendLip.ChangeMouthSeqNode
// [0x00020400]  (iNative[36102])
struct UREDAnimNodeBlendLip_execChangeMouthSeqNode_Params
{
	class FName                                        MouthNodeName;                                    // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeBlendLip.CloseMouth
// [0x00020400]  (iNative[13246])
struct UREDAnimNodeBlendLip_execCloseMouth_Params
{
};

// Function REDGame.REDAnimNodeBlendLip.OpenMouth
// [0x00024400]  (iNative[13353])
struct UREDAnimNodeBlendLip_execOpenMouth_Params
{
	int32_t                                            Type;                                             // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function REDGame.REDAnimNodeBlendLip.StopLip
// [0x00024400]  (iNative[13462])
struct UREDAnimNodeBlendLip_execStopLip_Params
{
	uint32_t                                           Linear : 1;                                       // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function REDGame.REDAnimNodeBlendLip.PlayLip
// [0x00024400]  (iNative[39035])
struct UREDAnimNodeBlendLip_execPlayLip_Params
{
	int32_t                                            Type;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           Linear : 1;                                       // 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              Speed;                                            // 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            playFrame;                                        // 0x000C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function REDGame.REDAnimNodeBlendLip.ChangeMouthType
// [0x00020400]  (iNative[36104])
struct UREDAnimNodeBlendLip_execChangeMouthType_Params
{
	int32_t                                            Type;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeBlendLip.SetBlendTarget
// [0x00020400]  (iNative[27891])
struct UREDAnimNodeBlendLip_execSetBlendTarget_Params
{
	float                                              BlendTarget;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              BlendTime;                                        // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeScarfSystem.UpdateScarfSystem
// [0x00020400]  (iNative[40840])
struct UREDAnimNodeScarfSystem_execUpdateScarfSystem_Params
{
	uint32_t                                           bStopShrink : 1;                                  // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function REDGame.REDAnimNodeScarfSystem.StopScarfSystem
// [0x00020400]  (iNative[40104])
struct UREDAnimNodeScarfSystem_execStopScarfSystem_Params
{
	int32_t                                            BlendFrame;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeScarfSystem.StartScarfSystem
// [0x00020400]  (iNative[40032])
struct UREDAnimNodeScarfSystem_execStartScarfSystem_Params
{
	int32_t                                            BlendFrame;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeSequence.JumpCutSceneAnimeFrame
// [0x00020400]  (iNative[37949])
struct UREDAnimNodeSequence_execJumpCutSceneAnimeFrame_Params
{
	float                                              frame;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeSequence.IsAnimeEnd
// [0x00020400]  (iNative[13308])
struct UREDAnimNodeSequence_execIsAnimeEnd_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDAnimNodeSequence.SetAnimeFrame
// [0x00020400]  (iNative[39690])
struct UREDAnimNodeSequence_execSetAnimeFrame_Params
{
	int32_t                                            frame;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeSequence.StepAnime
// [0x00020400]  (iNative[40090])
struct UREDAnimNodeSequence_execStepAnime_Params
{
	int32_t                                            frame;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimNodeSequence.SetAnim
// [0x00020400]  (iNative[27871])
struct UREDAnimNodeSequence_execSetAnim_Params
{
	class FName                                        Sequence;                                         // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDAnimTree.ZeroScale
// [0x00020401]  (iNative[41039])
struct UREDAnimTree_execZeroScale_Params
{
};

// Function REDGame.REDAnimTree.ResetScaleController
// [0x00020401]  (iNative[39388])
struct UREDAnimTree_execResetScaleController_Params
{
};

// Function REDGame.REDAnywhereDisp.StopNewChallenger
// [0x00020802] 
struct UREDAnywhereDisp_eventStopNewChallenger_Params
{
};

// Function REDGame.REDAnywhereDisp.PlayNewChallenger
// [0x00020802] 
struct UREDAnywhereDisp_eventPlayNewChallenger_Params
{
};

// Function REDGame.REDAnywhereDisp.Initialize
// [0x00020800] 
struct UREDAnywhereDisp_eventInitialize_Params
{
};

// Function REDGame.REDAnywhereDisp.UpdateFreeTrialInfomation
// [0x00020400]  (iNative[40678])
struct UREDAnywhereDisp_execUpdateFreeTrialInfomation_Params
{
};

// Function REDGame.REDAnywhereDisp.UpdateNewChallengerDraw
// [0x00020400]  (iNative[40794])
struct UREDAnywhereDisp_execUpdateNewChallengerDraw_Params
{
};

// Function REDGame.REDAnywhereDisp.IsNewChallengerDrawEnd
// [0x00020400]  (iNative[37746])
struct UREDAnywhereDisp_execIsNewChallengerDrawEnd_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDAnywhereDisp.RequestNewChallengerDraw
// [0x00020400]  (iNative[39370])
struct UREDAnywhereDisp_execRequestNewChallengerDraw_Params
{
};

// Function REDGame.REDAnywhereDisp.Update
// [0x00020400]  (iNative[13049])
struct UREDAnywhereDisp_execUpdate_Params
{
};

// Function REDGame.REDArcadeScript.TebureCamera
// [0x00020802] 
struct UREDArcadeScript_eventTebureCamera_Params
{
	uint32_t                                           On : 1;                                           // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              Mag;                                              // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class AREDPlayerController_Battle*              PC;                                               // 0x0008 (0x0004) [0x0000000000000000]               
	// class AREDCamera_Battle*                        Cam;                                              // 0x000C (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.ShakeCamera
// [0x00020802] 
struct UREDArcadeScript_eventShakeCamera_Params
{
	float                                              X;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Y;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            frame;                                            // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           isFadeout : 1;                                    // 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class AREDPlayerController_Battle*              PC;                                               // 0x0010 (0x0004) [0x0000000000000000]               
	// class AREDCamera_Battle*                        Cam;                                              // 0x0014 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.FOVCamera
// [0x00020802] 
struct UREDArcadeScript_eventFOVCamera_Params
{
	float                                              Start;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              End;                                              // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            frame;                                            // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class AREDPlayerController_Battle*              PC;                                               // 0x000C (0x0004) [0x0000000000000000]               
	// class AREDCamera_Battle*                        Cam;                                              // 0x0010 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.MoveCamera
// [0x00020802] 
struct UREDArcadeScript_eventMoveCamera_Params
{
	struct FVector                                     Start;                                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     End;                                              // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            frame;                                            // 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class AREDPlayerController_Battle*              PC;                                               // 0x001C (0x0004) [0x0000000000000000]               
	// class AREDCamera_Battle*                        Cam;                                              // 0x0020 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.RotateCamera
// [0x00020802] 
struct UREDArcadeScript_eventRotateCamera_Params
{
	struct FRotator                                    Start;                                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    End;                                              // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            frame;                                            // 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class AREDPlayerController_Battle*              PC;                                               // 0x001C (0x0004) [0x0000000000000000]               
	// class AREDCamera_Battle*                        Cam;                                              // 0x0020 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.PresetCamera
// [0x00820802] 
struct UREDArcadeScript_eventPresetCamera_Params
{
	class FString                                      CharaID;                                          // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            Type;                                             // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            frame;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Loc;                                              // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           isReverse : 1;                                    // 0x0020 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class AREDPlayerController_Battle*              PC;                                               // 0x0024 (0x0004) [0x0000000000000000]               
	// class AREDCamera_Battle*                        Cam;                                              // 0x0028 (0x0004) [0x0000000000000000]               
	// int32_t                                         MainPlayer;                                       // 0x002C (0x0004) [0x0000000000000000]               
	// struct FTPOV                                    POV;                                              // 0x0030 (0x001C) [0x0000000000000000]               
	// int32_t                                         Index;                                            // 0x004C (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.ResetCamera
// [0x00020802] 
struct UREDArcadeScript_eventResetCamera_Params
{
	// class AREDPlayerController_Battle*              PC;                                               // 0x0000 (0x0004) [0x0000000000000000]               
	// class AREDCamera_Battle*                        Cam;                                              // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.Update
// [0x00020802] 
struct UREDArcadeScript_eventUpdate_Params
{
	// class UAudioComponent*                          Item;                                             // 0x0000 (0x0004) [0x0000000004000000] (CPF_EditInline)
};

// Function REDGame.REDArcadeScript.IsSoundPlaying
// [0x00020802] 
struct UREDArcadeScript_eventIsSoundPlaying_Params
{
	class USoundCue*                                   Cue;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// int32_t                                         I;                                                // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.StopSound
// [0x00020802] 
struct UREDArcadeScript_eventStopSound_Params
{
	// class UAudioComponent*                          Item;                                             // 0x0000 (0x0004) [0x0000000004000000] (CPF_EditInline)
};

// Function REDGame.REDArcadeScript.PlaySound
// [0x00020802] 
struct UREDArcadeScript_eventPlaySound_Params
{
	class USoundCue*                                   Cue;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class AREDGameInfo*                             Game;                                             // 0x0004 (0x0004) [0x0000000000000000]               
	// class UAudioComponent*                          Comp;                                             // 0x0008 (0x0004) [0x0000000004000000] (CPF_EditInline)
};

// Function REDGame.REDArcadeScript.SetVolumeBGM
// [0x00020802] 
struct UREDArcadeScript_eventSetVolumeBGM_Params
{
	class FString                                      Id;                                               // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              Time;                                             // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Vol;                                              // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         Index;                                            // 0x0014 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.FadeOutBGM
// [0x00020802] 
struct UREDArcadeScript_eventFadeOutBGM_Params
{
	class FString                                      Id;                                               // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              Time;                                             // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         Index;                                            // 0x0010 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.FadeInBGM
// [0x00820802] 
struct UREDArcadeScript_eventFadeInBGM_Params
{
	class FString                                      Id;                                               // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class USoundCue*                                   Cue;                                              // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Time;                                             // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         Index;                                            // 0x0014 (0x0004) [0x0000000000000000]               
	// class AREDGameInfo*                             Game;                                             // 0x0018 (0x0004) [0x0000000000000000]               
	// struct FEventPlayingBGM                         Item;                                             // 0x001C (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function REDGame.REDArcadeScript.GetLipSyncData
// [0x00020802] 
struct UREDArcadeScript_eventGetLipSyncData_Params
{
	class FString                                      VoicePackageName;                                 // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      TextID;                                           // 0x000C (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UREDAssetLipSync*                            ReturnValue;                                      // 0x0018 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDArcadeScript.GetCharScriptData
// [0x00020802] 
struct UREDArcadeScript_eventGetCharScriptData_Params
{
	class FString                                      CharaID;                                          // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UREDAssetEventScript*                        ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDArcadeScript.LoadEventPackage
// [0x00420800] 
struct UREDArcadeScript_eventLoadEventPackage_Params
{
	class FString                                      PackageName;                                      // 0x0000 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           bBlock : 1;                                       // 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function REDGame.REDArcadeScript.DestroyPawn
// [0x00020802] 
struct UREDArcadeScript_eventDestroyPawn_Params
{
	class AREDPawn*                                    Pawn;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDArcadeScript.SpawnPlayer
// [0x00820802] 
struct UREDArcadeScript_eventSpawnPlayer_Params
{
	class FString                                      CharaID;                                          // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class AREDPawn*                                    ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class AREDGameInfo*                             Game;                                             // 0x0010 (0x0004) [0x0000000000000000]               
	// int32_t                                         Index;                                            // 0x0014 (0x0004) [0x0000000000000000]               
	// struct FSpawnPlayerInfo                         Info;                                             // 0x0018 (0x0064) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function REDGame.REDArcadeScript.LoadCharaPackages
// [0x00420002] 
struct UREDArcadeScript_execLoadCharaPackages_Params
{
	class TArray<class FString>                        packageNames;                                     // 0x0000 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           bBlock : 1;                                       // 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class UREDCharaAsset*                           Asset;                                            // 0x0010 (0x0004) [0x0000000000000000]               
	// class AREDGameInfo*                             Game;                                             // 0x0014 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDArcadeScript.GetCharaPackageNames
// [0x00420002] 
struct UREDArcadeScript_execGetCharaPackageNames_Params
{
	struct FSpawnPlayerInfo                            Info;                                             // 0x0000 (0x0064) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class TArray<class FString>                        packageNames;                                     // 0x0064 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function REDGame.REDArcadeScript.LoadChara
// [0x00020800] 
struct UREDArcadeScript_eventLoadChara_Params
{
	class FString                                      CharaID;                                          // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function REDGame.REDAsyncLoadPackageManager.IsLoadComplete
// [0x00020802] 
struct UREDAsyncLoadPackageManager_eventIsLoadComplete_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDAsyncLoadPackageManager.LoadPackage
// [0x00420802] 
struct UREDAsyncLoadPackageManager_eventLoadPackage_Params
{
	class FString                                      PackageName;                                      // 0x0000 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           isBlock : 1;                                      // 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class TArray<class FString>                     Packages;                                         // 0x0010 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function REDGame.REDAsyncLoadPackageManager.LoadPackages
// [0x00420802] 
struct UREDAsyncLoadPackageManager_eventLoadPackages_Params
{
	class TArray<class FString>                        packageNames;                                     // 0x0000 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           isBlock : 1;                                      // 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function REDGame.REDBGMaterialController.Update
// [0x00020400]  (iNative[13049])
struct UREDBGMaterialController_execUpdate_Params
{
};

// Function REDGame.REDBGMaterialController.SetBrightness
// [0x00020400]  (iNative[39701])
struct UREDBGMaterialController_execSetBrightness_Params
{
	float                                              Brightness;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDBGMaterialController.FadeOut
// [0x00020400]  (iNative[13267])
struct UREDBGMaterialController_execFadeOut_Params
{
	float                                              Brightness;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            frame;                                            // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDBGMaterialController.FadeIn
// [0x00020400]  (iNative[13265])
struct UREDBGMaterialController_execFadeIn_Params
{
	int32_t                                            frame;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function REDGame.REDBGMaterialController.Initialize
// [0x00020400]  (iNative[13305])
struct UREDBGMaterialController_execInitialize_Params
{
};

// Function REDGame.REDCamera_Adv.UpdateViewTarget
// [0x00420002] 
struct AREDCamera_Adv_execUpdateViewTarget_Params
{
	struct FTViewTarget                                OutVT;                                            // 0x0000 (0x002C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              DeltaTime;                                        // 0x002C (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class ACameraActor*                             CamActor;                                         // 0x0030 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bDoNotApplyModifiers : 1;                         // 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APawn*                                    TPawn;                                            // 0x0038 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDCamera_Adv.DisplayDebug
// [0x00420102] 
struct AREDCamera_Adv_execDisplayDebug_Params
{
	class AHUD*                                        HUD;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              out_YL;                                           // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_YPos;                                         // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function REDGame.REDCamera_Adv.UpdatePawnCameraParam
// [0x00420400]  (iNative[40804])
struct AREDCamera_Adv_execUpdatePawnCameraParam_Params
{
	struct FTPOV                                       POV;                                              // 0x0000 (0x001C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
};

// Function REDGame.REDCamera_Adv.UpdatePawnMaterialInstance
// [0x00020400]  (iNative[40807])
struct AREDCamera_Adv_execUpdatePawnMaterialInstance_Params
{
};

// Function REDGame.REDCamera_Adv.UpdateCameraAnimLight
// [0x00020400]  (iNative[40611])
struct AREDCamera_Adv_execUpdateCameraAnimLight_Params
{
};

// Function REDGame.REDCamera_CharaSelect.UpdateViewTarget
// [0x00420002] 
struct AREDCamera_CharaSelect_execUpdateViewTarget_Params
{
	struct FTViewTarget                                OutVT;                                            // 0x0000 (0x002C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              DeltaTime;                                        // 0x002C (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class ACameraActor*                             CamActor;                                         // 0x0030 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bDoNotApplyModifiers : 1;                         // 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APawn*                                    TPawn;                                            // 0x0038 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDCamera_CharaSelect.DisplayDebug
// [0x00420102] 
struct AREDCamera_CharaSelect_execDisplayDebug_Params
{
	class AHUD*                                        HUD;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              out_YL;                                           // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_YPos;                                         // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function REDGame.REDCamera_CharaSelect.UpdatePawnMaterialInstance
// [0x00020400]  (iNative[40807])
struct AREDCamera_CharaSelect_execUpdatePawnMaterialInstance_Params
{
};

// Function REDGame.REDCamera_CharaSelect.UpdatePawnCameraParam
// [0x00420400]  (iNative[40804])
struct AREDCamera_CharaSelect_execUpdatePawnCameraParam_Params
{
	struct FTPOV                                       POV;                                              // 0x0000 (0x001C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
};

// Function REDGame.REDCamera_DigitalFigure.UpdateViewTarget
// [0x00420002] 
struct AREDCamera_DigitalFigure_execUpdateViewTarget_Params
{
	struct FTViewTarget                                OutVT;                                            // 0x0000 (0x002C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              DeltaTime;                                        // 0x002C (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class ACameraActor*                             CamActor;                                         // 0x0030 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bDoNotApplyModifiers : 1;                         // 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	// class APawn*                                    TPawn;                                            // 0x0038 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDCamera_DigitalFigure.DisplayDebug
// [0x00420102] 
struct AREDCamera_DigitalFigure_execDisplayDebug_Params
{
	class AHUD*                                        HUD;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              out_YL;                                           // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_YPos;                                         // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function REDGame.REDCamera_DigitalFigure.UpdatePawnCameraParam
// [0x00420400]  (iNative[40804])
struct AREDCamera_DigitalFigure_execUpdatePawnCameraParam_Params
{
	struct FTPOV                                       POV;                                              // 0x0000 (0x001C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
};

// Function REDGame.REDCamera_DigitalFigure.UpdatePawnMaterialInstance
// [0x00020400]  (iNative[40807])
struct AREDCamera_DigitalFigure_execUpdatePawnMaterialInstance_Params
{
};

// Function REDGame.REDCamera_DigitalFigure.UpdateCameraAnimLight
// [0x00020400]  (iNative[40611])
struct AREDCamera_DigitalFigure_execUpdateCameraAnimLight_Params
{
};

// Function REDGame.REDCameraAnimArray.GetCameraAnim
// [0x00020002] 
struct UREDCameraAnimArray_execGetCameraAnim_Params
{
	class FName                                        AnimName;                                         // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UCameraAnim*                                 ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// int32_t                                         Index;                                            // 0x000C (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDCameraOffsetDataArray.AddOffsetData
// [0x00C20002] 
struct UREDCameraOffsetDataArray_execAddOffsetData_Params
{
	struct FVector                                     PosOffset;                                        // 0x0000 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FRotator                                    RotOffset;                                        // 0x000C (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	// struct FCameraOffsetData                        Data;                                             // 0x0018 (0x0018) [0x0000000000000000]               
};

// Function REDGame.REDCharaAssetLoader.CheckExistPackage
// [0x00422401]  (iNative[36196])
struct UREDCharaAssetLoader_execCheckExistPackage_Params
{
	struct FSpawnPlayerInfo                            Info;                                             // 0x0000 (0x0064) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	bool                                               ReturnValue : 1;                                  // 0x0064 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDCharaAssetLoader.GetPackageNamesForDrama
// [0x00422401]  (iNative[37126])
struct UREDCharaAssetLoader_execGetPackageNamesForDrama_Params
{
	struct FSpawnPlayerInfo                            Info;                                             // 0x0000 (0x0064) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      textLang;                                         // 0x0064 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      voiceLang;                                        // 0x0070 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class TArray<class FString>                        packageNames;                                     // 0x007C (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function REDGame.REDCharaAssetLoader.GetPackageNamesForMOM
// [0x00422401]  (iNative[37127])
struct UREDCharaAssetLoader_execGetPackageNamesForMOM_Params
{
	struct FSpawnPlayerInfo                            Info;                                             // 0x0000 (0x0064) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class TArray<class FString>                        packageNames;                                     // 0x0064 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function REDGame.REDCharaAssetLoader.LoadAssets
// [0x00422401]  (iNative[38017])
struct UREDCharaAssetLoader_execLoadAssets_Params
{
	class UObject*                                     outerObject;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<class FString>                        packageNames;                                     // 0x0004 (0x000C) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           bBlocking : 1;                                    // 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	class UREDCharaAsset*                              ReturnValue;                                      // 0x0014 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function REDGame.REDCharaAssetLoader.GetPackageNamesSimple
// [0x00422401]  (iNative[37129])
struct UREDCharaAssetLoader_execGetPackageNamesSimple_Params
{
	struct FSpawnPlayerInfo                            Info;                                             // 0x0000 (0x0064) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class TArray<class FString>                        packageNames;                                     // 0x0064 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           bColorOnly : 1;                                   // 0x0070 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function REDGame.REDCharaAssetLoader.GetPackageNamesForOnlyDrama
// [0x00422401]  (iNative[37128])
struct UREDCharaAssetLoader_execGetPackageNamesForOnlyDrama_Params
{
	struct FSpawnPlayerInfo                            Info;                                             // 0x0000 (0x0064) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class TArray<class FString>                        packageNames;                                     // 0x0064 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function REDGame.REDCharaAssetLoader.GetPackageNames
// [0x00422401]  (iNative[37125])
struct UREDCharaAssetLoader_execGetPackageNames_Params
{
	struct FSpawnPlayerInfo                            Info;                                             // 0x0000 (0x0064) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class TArray<class FString>                        packageNames;                                     // 0x0064 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function REDGame.REDCheatManager.Twitter
// [0x00024202] 
struct UREDCheatManager_execTwitter_Params
{
	class FString                                      Exec;                                             // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      argv1;                                            // 0x000C (0x000C) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
	class FString                                      argv2;                                            // 0x0018 (0x000C) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
};

// Function REDGame.REDCheatManager.TwitterControl
// [0x00420400]  (iNative[40294])
struct UREDCheatManager_execTwitterControl_Params
{
	class FString                                      Exec;                                             // 0x0000 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      argv1;                                            // 0x000C (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      argv2;                                            // 0x0018 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function REDGame.REDCheatManager_Battle.DumpActorTrans
// [0x00024200] 
struct UREDCheatManager_Battle_execDumpActorTrans_Params
{
	class FName                                        actorName;                                        // 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class FName                                        LayerName;                                        // 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function REDGame.REDCheatManager_Battle.EnableDebugCamera
// [0x00820002] 
struct UREDCheatManager_Battle_execEnableDebugCamera_Params
{
	uint32_t                                           bEnableDebugText : 1;                             // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class UPlayer*                                  P;                                                // 0x0004 (0x0004) [0x0000000000000000]               
	// struct FVector                                  eyeLoc;                                           // 0x0008 (0x000C) [0x0000000000000000]               
	// struct FRotator                                 eyeRot;                                           // 0x0014 (0x000C) [0x0000000000000000]               
	// float                                           CameraFOVAngle;                                   // 0x0020 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDCheatManager_Battle.ToggleDebugCamera
// [0x00024202] 
struct UREDCheatManager_Battle_execToggleDebugCamera_Params
{
	uint32_t                                           bDrawDebugText : 1;                               // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	// class APlayerController*                        PC;                                               // 0x0004 (0x0004) [0x0000000000000000]               
	// class ADebugCameraController*                   DCC;                                              // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function REDGame.REDControlModule.UpdateRotation
// [0x00020000] 
struct UREDControlModule_execUpdateRotation_Params
{
